[
    {
        "title": "Middle-aged man trading cards go viral in rural Japan town",
        "url": "https://www.tokyoweekender.com/entertainment/middle-aged-man-trading-cards-go-viral-in-japan/",
        "content": "Japan Life Art & Culture Food & Drink Travel Entertainment Events Magazine About Us THINGS TO DO IN TOKYO NEWS & OPINION HEALTH & BEAUTY JAPANESE LANGUAGE ART & DESIGN FASHION BOOKS HISTORY & CULTURE RESTAURANTS & BARS RECIPES HOKKAIDO TOHOKU KANTO SHIKOKU CHUBU KANSAI CHUGOKU KYUSHU OKINAWA ANIME & MANGA MUSIC TECHNOLOGY SPORTS MOVIES & TV TODAY THIS WEEK THIS WEEKEND THIS MONTH MAGAZINE ARCHIVES STOCKISTS NEWSLETTER ABOUT US CONTACT US HOME \\ ENTERTAINMENT \\ MIDDLE-AGED MAN TRADING CARDS GO VIRAL IN RURAL JAPAN TOWN NEWS & OPINION ENTERTAINMENT Middle-Aged Man Trading Cards Go Viral in Rural Japan Town Why kids in Fukuoka are obsessed with collecting cards with middle-aged men on them BY YNES SARAH FILLEUL MARCH 25, 2025 In the small town of Kawara in Fukuoka Prefecture, something unexpected is happening at the Saidosho Community Center. While kids in most parts of Japan are obsessed with Pokémon cards — or perhaps the franchise’s latest smartphone game, Pokémon TCG Pocket — the children of Kawara are clutching to something a little closer to home. They are playing a trading card game (TCG) where the stars aren’t fantasy creatures, anime heroes or even famous baseball players, but ojisan (middle-aged or older men) from the local community of Saidosho. LIST OF CONTENTS: A CARD GAME WITH A LOCAL TWIST FROM COLLECTING TO BATTLING RELATED POSTS IMAGE: MAYUKO ICHII | EDITS BY TW A Card Game With a Local Twist On the surface, this Ojisan TCG looks like any other collectible card game. As of March 18, there are 47 different cards in the collection, including 28 featuring local men with stats and special abilities. Take the Firewall card, for example. It features Mr. Honda (74), a former fire brigade chief who helped keep the town safe for decades. Then there’s Soba Master Mr. Takeshita (81), who runs a local soba noodle-making class and now holds legendary status among the town’s youth. The most popular of them all is probably All-Rounder Mr. Fujii (68), a former prison officer turned community volunteer. His card is so sought after that local kids have even started asking him for autographs. “I was honestly shocked when they asked me to sign it,” Mr. Fujii said, laughing. “I never imagined I’d become a trading card, let alone have fans.” Each card comes with different attacks and an assigned elemental type — just like a classic fantasy card game — but with a humorous, real-world edge. For instance, Firewall is, unsurprisingly, a fire type, equipped with a Super Guard move, which deals a hefty 200 damage. A card called Plasma Conductor, featuring a smiling, bespectacled ojisan juxtaposed with an image of a lightbulb, is an electric type. At the bottom of the card, there is a line of text explaining how he can fix any electrical appliance without fail. SCREENSHOT TAKEN FROM FNN PRIME ONLINE From Collecting to Battling The creator of the game is Eri Miyahara, the Secretary General of the Saidosho Community Council. “We wanted to strengthen the connection between the children and the older generations in the community. There are so many amazing people here. I thought it was such a shame that no one knew about them,” she said in an interview with Fuji News Network (FNN). “Since the card game went viral, so many kids are starting to look up to these men as heroic figures.” The plan worked. Kids have started attending local events and volunteering for community activities — just for a chance to meet the ojisan from their cards. Participation in town events has reportedly doubled since the game launched. Interestingly, Ojisan TCG didn’t start as a competitive game. The first set of cards was designed purely for collecting, but the local children quickly turned it into something more dynamic. They began comparing stats and declaring, “My card is stronger than yours.” Seeing this, the game’s creator decided to take it to the next level. New rules were introduced, allowing the cards to be used in actual battles. The objective isn’t to defeat the opponent’s card but to outplay it based on the characters’ skills and abilities. The rarity of a card isn’t based on fantasy stats — it’s tied to real-world contributions. The more actively the ojisan engages in volunteer work or community service, the higher the chances of their card being upgraded to a shiny version with a glossy laminated effect. While the cards — all made entirely by hand — are currently in high demand and often out of stock, they are only available for sale at the Saidosho Community Center. A pack of three cards costs ¥100, while a pack of six cards — including a shiny card — costs ¥500. Despite the limited supply, demand remains high, with many kids saving their pocket money for a chance to score a shiny version of their favorite ojisan. Related Posts Pokemon TCG Pocket Continues To Dominate the App Charts On this Day in Japan: Nintendo Released the First Pokemon Games Yu-Gi-Oh! Tournament Breaks Two World Records for Number of Players RELATED POSTS ENTERTAINMENT What Generation I Pokémon Are You Based on Your Zodiac Sign? TECHNOLOGY Nintendo To Sell Cheaper Japanese-Only Version of Switch 2 NEWS & OPINION Japanese Politician Receives Death Threats Over Menstrual Care Post NEWS & OPINION Live Rat Discovered in Demae-Can Food Delivery Bag, Company Apologizes TW COLLABS SEE ALL TW COLLABS Where To Stay on Naoshima: A Complete Guide to Benesse House TW COLLABS Banyan Tree Higashiyama Kyoto: Timeless Elegance, Modern Comfort TW COLLABS Yonex: Serving the Future of Tennis Apparel TW COLLABS Artizon Museum Redefines How We Experience Art Today in the Heart of Tokyo ABOUT US CONTACT US ADVERTISE WITH US READ THE MAGAZINE STOCKISTS INSIDER’S CLUB NEWSLETTER PRIVACY POLICY TERMS & CONDITIONS SITEMAP CONNECT WITH US © TOKYO WEEKENDER ALL RIGHTS RESERVED. UNAUTHORIZED REPRODUCTION PROHIBITED. POWERED BY ENGAWA CO., LTD. Tokyo Weekender Data and Cookie Consent To provide a more personal user experience, we and our 213 partners use technology such as cookies to store and/or access device information. By clicking “Accept,” you consent to the use of these technologies which will allow us and our partners to process personal data such as IP address, unique ID, and browsing data on this site. To manage your consent preferences, please click on the “Manage Settings” button. You can withdraw or update your consent preferences at any time by clicking the “Update Privacy Settings” link at the bottom of the website. We use your data to: Store and/or access information on a device; Use limited data to select advertising; Create profiles for personalized advertising; Use profiles to select personalized advertising; Create profiles to personalize content; Use profiles to select personalized content; Measure advertising performance; Measure content performance; Understand audiences through statistics or combinations of data from different sources; Develop and improve services; Use limited data to select content; Ensure security, prevent and detect fraud, and fix errors; Deliver and present advertising and content; Save and communicate privacy choices. Manage Settings Accept Update Privacy Settings",
        "headline": "Middle-Aged Man Trading Cards Go Viral in Rural Japan Town",
        "entry_sentence": "In a surprising trend, children in the rural town of Kawara, Fukuoka Prefecture, are collecting trading cards featuring local middle-aged men.",
        "detail": "The game, created to strengthen bonds between generations, has become popular, leading to increased participation in community activities and events.",
        "icon": "🃏"
    },
    {
        "title": "Show HN: Browser MCP – Automate your browser using Cursor, Claude, VS Code",
        "url": "https://browsermcp.io/",
        "content": "Browser MCP GitHub Browser MCP Connect AI apps to your browser to automate tests and tasks Add to Chrome Documentation What is this? If you want to automate actions on a website, like repeatedly fill out a form, you normally can't do it with AI apps like Cursor or Claude because they don't have access to a web browser. With Browser MCP, you can connect AI apps to your browser so they can automate tasks on your behalf. Use Cases Speed up and automate your workflows 🧪 Automated Testing Enable your AI editor to automatically test your code end-to-end. Test user flows, validate UI elements, and ensure your application works as expected across different scenarios. ⚙️ Task Automation Automate repetitive web-based tasks with ease. From data collection and form filling to workflow automation, save time and reduce errors in your day-to-day operations. Why Browser MCP? Automate with speed, security, and convenience ⚡ Fast Automation happens locally on your machine, resulting in better performance without network latency. 🔒 Private Since automation happens locally, your browser activity stays on your device and isn't sent to remote servers. 👤 Logged In Uses your existing browser profile, keeping you logged into all your services. 🥷 Stealth Avoids basic bot detection and CAPTCHAs by using your real browser fingerprint. How It Works Get started with Browser MCP in three simple steps 1 Install the Browser MCP Extension Add the Browser MCP extension to your browser. 2 Set up MCP Server Add the Browser MCP server to your AI application to connect with the browser extension. 3 Start Automating Begin creating automated workflows and let your AI assistant handle repetitive tasks in your browser. Browser Tools Everything you need to automate your browser 🌐 Navigate Navigate to a URL ⬅️ Go Back Go back to the previous page ➡️ Go Forward Go forward to the next page ⏱️ Wait Wait for a specified time in seconds ⌨️ Press Key Press a key on the keyboard 📸 Snapshot Capture accessibility snapshot of the current page 👆 Click Perform click on a web page ✋ Drag & Drop Perform drag and drop between two elements 👋 Hover Hover over element on page 🔤 Type Text Type text into editable element 📝 Select Option Select an option in a dropdown 🖥️ Get Console Logs Get the console logs from the browser Works with your favorite MCP AI application Cursor Claude Windsurf VSCode AI + Your Browser = 🪄 Install Browser MCP ⚡ Built with ExtensionStack by Namu",
        "headline": "New Tool Connects AI Apps to Web Browsers",
        "entry_sentence": "Browser MCP is a new extension that allows AI applications to automate tasks in web browsers.",
        "detail": "By connecting AI tools to the browser, users can streamline repetitive tasks like filling out forms and testing code, all while ensuring privacy and performance.",
        "icon": "🌐"
    },
    {
        "title": "Show HN: Lux – A luxurious package manager for Lua",
        "url": "https://mrcjkb.dev/posts/2025-04-07-lux-announcement.html",
        "content": "mrcjkb.dev HOME ABOUT CONTACT CV ARCHIVE Announcing Lux - a luxurious package manager for Lua Posted on April 7, 2025 It’s time Lua got the ecosystem it deserves! For a bit over a year, we have been cooking up Lux, a new package manager for creating, maintaining and publishing Lua code. It does this through a simple and intuitive CLI inspired by other well-known package managers like cargo. Today, we feel the project has hit a state of “very usable for everyday tasks”1. Features Fully portable between systems. Parallel builds and installs. 🚀 Handles the installation of Lua headers2 for you. Forget about users complaining they have the wrong Lua headers installed on their system. All you need to do is specify compatible lua versions. A fully embeddable lux-lib crate, which can even be built to expose a Lua API. Has an actual notion of a “project”, with a simple governing lux.toml file. Uses the lux.toml to auto-generate rockspecs. Say goodbye to managing 10 different rockspec files in your repository. 🎉 Powerful lockfile support. Fully reproducible builds and developer environments. Source + rockspec hashes that can be used to make Lux easy to integrate with Nix. Integrated code formatting (lx fmt) and linting (lx check) powered by stylua and luacheck. Native support for running tests with busted. Including the ability to use Neovim as a Lua interpreter. Sets up a pure environment. Compatible with the luarocks ecosystem. In case you have a complex rockspec that you don’t want to rewrite to TOML, lux allows you to create an extra.rockspec file, so everything just works. Need to install a package that uses a custom luarocks build backend? Lux can install luarocks and shell out to it for the build step, while managing dependencies natively. Motivation Lua While extensive, Luarocks carries with it around 20 years of baggage, which makes it difficult to make suitable for modern Lua development, while retaining backward compatibility. With Lux, we’re pushing for a fresh start: A notion of a project: With TOML as the main manifest format, you can easily add, remove, pin and update dependencies using the CLI. If you’re in a project directory (with a lux.toml), commands like build will build your project, and install it into a project-local tree. Building will produce a lockfile of your project’s dependencies, allowing you to reproduce your exact dependencies on any compatible system. Enforced SemVer: Luarocks allows for arbitrary versions after the patch version. For example, 1.0.1.0.0.0.2 is considered valid by Luarocks, but it has no useful meaning. Lux will parse this too, but will treat everything after the patch version as a prerelease version. We made this decision because we want to encourage package maintainers to stick to SemVer for their releases. Parallel builds: Inspired by the Nix store, Lux hashes3 install directories to prevent package conflicts and enable highly parallel builds without risking file system corruption. Neovim Thanks to our Neovim plugin manager, rocks.nvim, and the later addition of Luarocks support to lazy.nvim, Luarocks has been steadily gaining popularity in the Neovim space as a way of distributing plugins. But it’s been heavily held back by not being fully portable and by being unpredictable from system to system. Because Luarocks is written in Lua, installing a large number of packages and synchronising plugins with rocks.nvim has been painfully slow. With Lux, we hope that plugins will start treating themselves as Lua projects. Using Lux is non-destructive and doesn’t interfere with the current way of distributing Neovim plugins (which is via git). In fact, Lux has a --nvim flag, which tells it to install packages into a tree structure that is compatible with Neovim’s :h packages. Nix If a Neovim plugin exists as a Luarocks package, nixpkgs will use it as the source of truth. This is mainly because with a proper package manager, the responsibility of declaring dependencies is the responsibility of the package author. However, Luarocks has very basic lockfile support, which does not include source hashes. While Luarocks (as does Lux) supports conflicting dependencies via its luarocks.loader, nixpkgs cannot reasonably add multiple versions of the same dependency to its package set. Lux’s lux.lock, stores source and rockspec hashes of each dependency. If the source URL is a git repository, lux will store a NAR hash. This means the a lux.lock can be used to create a fixed-output derivation with all dependencies, just as you can do with a Cargo.lock. Next steps Right now, our priorities are set on squashing bugs and improving error messages. Soon, we’ll be rewriting rocks.nvim to use Lux instead of Luarocks under the hood. This should let rocks.nvim catch up with other plugin managers in terms of speed and make it endlessly more stable than before. If the rewrite is successful, then that spells great news for the Neovim ecosystem going forward, as it means that Lux can be embedded in other places too (e.g. lazy.nvim, which has had troubles with luarocks in the past)! Documentation If you’d like to jump on the Lux train early, head over to our documentation website. A tutorial as well as guides can be found on there. If you have any questions or issues, feel free to reach out in the GitHub discussions or our issue tracker. Cheers! :) The Lux Team License Lux is licensed under MIT. The Lux logo © 2025 by Kai Jakobi is licensed under CC BY-NC-SA 4.0. We still have things to flesh out, like MSVC support, error messages and edge cases, but all those fixes are planned for the 1.0 release.↩︎ Lua 5.1, 5.2, 5.3. 5.4 and luajit.↩︎ See our guide for details.↩︎ Site proudly generated by Hakyll",
        "headline": "Introduction of Lux: A New Package Manager for Lua",
        "entry_sentence": "A new package manager named Lux has been announced for the Lua programming language.",
        "detail": "Designed to simplify the management of Lua code, Lux offers features like a user-friendly command line interface, parallel builds, and enhanced dependency management, promoting a modern approach to Lua development.",
        "icon": "📦"
    }
]