[
    {
        "title": "But what if I want a faster horse?",
        "url": "https://rakhim.exotext.com/but-what-if-i-really-want-a-faster-horse",
        "content": "← Rakhim's blog But what if I really want a faster horse? 4 April 2025 People in tech business circles love this quote by Henry Ford: If I had asked people what they wanted, they would have said faster horses. The idea is to think outside the box and create entirely new markets instead of just new products in existing ones. Like Apple creating the iPhone (sure, smartphones existed before—but cars also existed before the Ford Model T). But sometimes, I really want a faster horse. Netflix in 2012 was a super fast horse. It had a simple but massive catalog of movies and shows, solid recommendations, and basic library management. Compared to my limited local media library it was great. You could actively tune your tastes and rate things with a 5-star system. Netflix today is very different. It’s not a library—it’s an experience. Instead of reliably showing me what I \"have\" and recommending what I might like, it shuffles content on each interaction, sometimes changing the cover images of shows in real time, like some black-market charlatan. It has no meaningful catalog, no real categories—just short-lived, auto-generated groups like “Binge-worthy” or “Festive spirit.” Even the “New” section is meaningless. It opens with a “For You” row (huh?), then “Continue Watching”, followed by generic \"Popular in \" rows. It feels like YouTube search: ask for something specific, get a few hits, and then a flood of unrelated \"popular\" and \"recommended\" content. “My List” on Netflix randomly shuffles items and changes their covers every few hours. “Continue Watching” may or may not include what I actually watched recently. Sometimes, the engagement algorithms resurrect some random Slovakian cartoon I opened three years ago—one and immediately closed because it that had no English subtitles here in Finland, even though they do exist in other regions. I just want a faster horse. Spotify in 2015 was also a super fast horse. It was like my iTunes library, but with millions more tracks. Getting new music became faster, but it didn’t change the nature of my relationship with music. Spotify today is... basically Netflix. An inconsistent stream of ever-changing content, weak library tools, and an endless barrage of podcasts. Overall, consistency, user control, and actual UX innovation are in decline. Everything is converging on TikTok—which is basically TV with infinite channels. You don’t control anything except the channel switch. It's like Carcinisation, a form of convergent evolution where unrelated crustaceans all evolve into something vaguely crab-shaped. The list goes on: YouTube. YouTube: Once a video catalog with social discovery. Now? TikTok. LinkedIn. Once a network of resumes. Now? TikTok. Substack. Yeah, a newsletter platform... now launching TikTok-style videos. Seriously. Powered by Exotext",
        "headline": "Frustration with streaming service evolution",
        "entry_sentence": "Many users express disappointment with the direction of popular streaming services like Netflix and Spotify.",
        "detail": "Originally known for their simple and extensive catalogs, these platforms have shifted to chaotic interfaces that prioritize algorithm-driven content over user control, leaving users longing for the straightforward experience they once had.",
        "icon": "🟣"
    },
    {
        "title": "Fintech founder charged with fraud; AI app found to be humans in the Philippines",
        "url": "https://techcrunch.com/2025/04/10/fintech-founder-charged-with-fraud-after-ai-shopping-app-found-to-be-powered-by-humans-in-the-philippines/",
        "content": "We, TechCrunch, are part of the Yahoo family of brands. When you use our sites and apps, we use cookies to: provide our sites and apps to you authenticate users, apply security measures, and prevent spam and abuse, and measure your use of our sites and apps If you click 'Accept all', we and our partners including 238 who are part of the IAB Transparency & Consent Framework, will also store and/or access information on a device (in other words, use cookies) and use precise geolocation data and other personal data such as IP address and browsing and search data, for personalised advertising and content, advertising and content measurement, and audience research and services development. If you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'. If you would like to customise your choices, click 'Manage privacy settings'. You can withdraw your consent or change your choices at any time by clicking on the 'Privacy & cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our privacy policy and cookie policy. Manage privacy settings Reject all Accept all Skip to content TechCrunch Desktop Logo Latest Startups Venture Apple Security AI Apps Events Podcasts Newsletters Sign In Site Search Toggle Mega Menu Toggle Topics Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture More from TechCrunch Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us IMAGE CREDITS: ANDREW HARRER / BLOOMBERG (OPENS IN A NEW WINDOW) / GETTY IMAGES STARTUPS Fintech founder charged with fraud after ‘AI’ shopping app found to be powered by humans in the Philippines Charles Rollet 2:42 PM PDT · April 10, 2025 Albert Saniger, the founder and former CEO of Nate, an AI shopping app that promised a “universal” checkout experience, was charged with defrauding investors on Wednesday, according to a press release from the U.S. Department of Justice. Founded in 2018, Nate raised over $50 million from investors like Coatue and Forerunner Ventures, most recently raising a $38 million Series A in 2021 led by Renegade Partners. Nate said its app’s users could buy from any e-commerce site with a single click, thanks to AI. In reality, however, Nate relied heavily on hundreds of human contractors in a call center in the Philippines to manually complete those purchases, the DOJ’s Southern District of New York alleges. Saniger raised millions in venture funding by claiming that Nate was able to transact online “without human intervention,” except for edge cases where the AI failed to complete a transaction. But despite Nate acquiring some AI technology and hiring data scientists, its app’s actual automation rate was effectively 0%, the DOJ claims. Nate’s heavy usage of human contractors was the subject of an investigation by The Information in 2022. Saniger didn’t respond to a request for comment. He is currently listed as a managing partner at New York VC Buttercore Partners, which didn’t respond to a request for comment either. The DOJ’s indictment says that Nate ran out of money and was forced to sell its assets in January 2023, leaving its investors with “near total” losses. Albert Saniger’s LinkedIn profile indicates he was no longer CEO as of 2023. Nate isn’t the only startup that has allegedly exaggerated its AI capabilities. For example, an “AI” drive-through software startup was also powered largely by humans in the Philippines, The Verge reported in 2023. More recently, Business Insider reported that an AI legal tech unicorn, EvenUp, used humans to do much of its work. Topics department of justice e-commerce Fintech Startups Charles Rollet Senior Reporter Charles Rollet is a senior reporter at TechCrunch. His investigative reporting has led to U.S. government sanctions against four tech companies, including China’s largest AI firm. Prior to joining TechCrunch, Charles covered the surveillance industry for IPVM. Charles is based in San Francisco, where he enjoys hiking with his dogs. You can contact Charles securely on Signal at charlesrollet.12 or +1-628-282-2811. View Bio Most Popular Lucid Motors wins bankruptcy auction for Nikola’s Arizona factory and other assets Fintech founder charged with fraud after ‘AI’ shopping app found to be powered by humans in the Philippines Mira Murati’s AI startup is reportedly aiming for a massive $2B seed round Bezos-backed EV startup Slate Auto’s pickup truck spotted in the wild The US Secretary of Education referred to AI as ‘A1,’ like the steak sauce OpenAI updates ChatGPT to reference your past chats WhatsApp introduces new features across chats, calls, and channels Loading the next article X LinkedIn Facebook Instagram youTube Mastodon Threads Bluesky TechCrunch Staff Contact Us Advertise Crunchboard Jobs Site Map Terms of Service Privacy Policy RSS Terms of Use Privacy & Cookie Settings Code of Conduct About Our Ads GTC 2025 Google Buys Wiz Claude Voice Mode Skype Shutdown Meta Llama Tech Layoffs ChatGPT © 2025 Yahoo. Some areas of this page may shift around if you resize the browser window. Be sure to check heading and document order.",
        "headline": "Fintech founder charged with fraud over AI shopping app",
        "entry_sentence": "Albert Saniger, the founder of Nate, has been charged with defrauding investors.",
        "detail": "The U.S. Department of Justice claims that his app, which was marketed as AI-driven, actually relied on human operators in the Philippines for transactions. Nate reportedly raised over $50 million but collapsed in early 2023, leaving investors with significant losses.",
        "icon": "🟣"
    },
    {
        "title": "Default styles for h1 elements are changing",
        "url": "https://developer.mozilla.org/en-US/blog/h1-element-styles/",
        "content": "Skip to main content Skip to search Google Cloud's Future of AI: Perspectives for Startups report covers AI trends, opportunities, and insights from 23 experts Download today AD Don't want to see ads? References Learn Plus Curriculum NEW Blog Tools Search MDN SEARCH Theme Log in Sign up for free In this article What's changing What to expect and when Fixing the Lighthouse warning Summary See also The Developer Data Platform for Critical Apps Build mobile and AI applications on a flexible, scalable data platform Explore Now AD Don't want to see ads? Default styles for h1 elements are changing Simon Pieters April 11, 2025 4 minute read Browsers are starting to roll out changes in default UA styles for nested section headings. Developers should check that their sites don't rely on UA styles for certain cases to avoid unexpected results and failing Lighthouse checks. In this post, we'll have a look at what the incoming changes are, how to identify if it's an issue on your pages, and some hints for conformant and better-structured websites. What's changing The HTML spec used to define an outline algorithm that gave <h1> elements an implicit semantic heading level based on how many sectioning elements (<section>, <aside>, <nav>, and <article>) it was nested inside. The browser rendering was such that section > h1 would have the same font-size and margin as <h2>. The section > section > h1 would be represented as <h3>, and so on. The default rendering was implemented in browsers in their UA styles, but not the heading level in the accessibility tree (what screen readers use). Websites started to use sectioning elements, but didn't expect to see the automatic heading levels from the outline algorithm. In general, this created confusion about where developers could use <h1> elements, tools handled the HTML differently, and the outline algorithm was considered problematic. The outline algorithm was removed from the HTML spec in 2022, but the UA stylesheet rules still remain. The rules in the default styles are what browser vendors are starting to remove now. CSS Copy to Clipboard /* where x is :is(article, aside, nav, section) */ x h1 { margin-block: 0.83em; font-size: 1.50em; } x x h1 { margin-block: 1.00em; font-size: 1.17em; } x x x h1 { margin-block: 1.33em; font-size: 1.00em; } x x x x h1 { margin-block: 1.67em; font-size: 0.83em; } x x x x x h1 { margin-block: 2.33em; font-size: 0.67em; } For example: HTML Copy to Clipboard Play <body> <h1>Level 1</h1> <section> <h1>Level 2</h1> <section> <h1>Level 3</h1> <section> <h1>Level 4</h1> </section> </section> </section> </body> This looks as follows in the old UA styles: The new UA styles will have this appearance: And here's the HTML example above with your browser's default styles: Play What to expect and when Alongside the changes in browser styles, page auditing tools like Lighthouse now flag cases of <h1>s without defined font-size as bad practice. Here's the gist of what to expect: <h1> will no longer adapt its style based on surrounding sectioning elements like <section>, <article>, <nav>, and <aside>. UA stylesheet will apply the same style to <h1> with no implicit styles that demote <h1> to match <h2>, <h3>, etc. Lighthouse will flag a warning if <h1> is used without a specified font-size. The Lighthouse deprecation warning to look out for is H1UserAgentFontSizeInSection. Hints for dealing with this are described in the next section. In terms of when this is happening, changes are rolling out in the following browsers in this timeline: Firefox From March 31, 2025, Firefox is rolling out changes to 50% of Beta 138 users to remove UA styles for h1 in article, aside, nav, or section on desktop. The plan is to roll out to 5% of users on the Firefox 138 stable release, ramp up to 50% of users, then ship on all platforms in Firefox 140. bug 1885509. Since Firefox 136, developers will see a console warning for h1s in article/aside/nav/section without author-defined font-size or margins: bug 1937568. To test in Firefox with the new behavior, set layout.css.h1-in-section-ua-styles.enabled to false in about:config. Chrome Since version 136, Chrome shows deprecation warnings for <h1> inside the 4 elements, when the <h1> uses the default smaller font size. Marking something deprecated in Chromium will lower Lighthouse scores for \"Best Practices\": issue 394111284 Safari There's no implementation bugs to track in Safari for these changes yet, but we can expect WebKit to follow with equivalent updates. Fixing the Lighthouse warning Lighthouse has recently inherited a check based on Chromium's DevTools warnings for sites that don't specify a font-size for <h1> elements. The new rule is called H1UserAgentFontSizeInSection and shows up since March following the addition of deprecation warnings. If you see the <h1> warning, make sure you're applying an explicit <h1> font-size and margins. Here's some recommended styles to use: CSS Copy to Clipboard h1 { margin-block: 0.67em; font-size: 2em; } To avoid overwriting other style rules that target <h1> you can use :where(), which has zero specificity: CSS Copy to Clipboard :where(h1) { margin-block: 0.67em; font-size: 2em; } The MDN page for heading elements now contains the usage notes listed above so there is a visible place for developers to see this information. Summary Here's some things to keep in mind: Do not rely on default browser styles for conveying a heading hierarchy. Explicitly define your document hierarchy using <h2> for second-level headings, <h3> for third-level, etc. Always define your own font-size and margin for <h1> elements. Consider updating your CSS resets to account for the change. Audit your site using Lighthouse and browser DevTools to check for deprecated usage. Check the usage notes on the MDN documentation for HTML section headings. See also Firefox: Intent to unship UA styles for h1 in article, aside, nav, section HTML issue: Remove UA style for h1-h6 in section (et. al.) and hgroup HTML pull request: Remove UA styles for h1 in article, aside, nav, section Firefox beta 138 changes announcement on Bluesky Previous Post Implications of Global Privacy Control Your blueprint for a better internet. MDN on Bluesky MDN on Mastodon MDN on X (formerly Twitter) MDN on GitHub MDN Blog RSS Feed MDN About Blog Careers Advertise with us Support Product help Report an issue Our communities MDN Community MDN Forum MDN Chat Developers Web Technologies Learn Web Development MDN Plus Hacks Blog Website Privacy Notice Cookies Legal Community Participation Guidelines Visit Mozilla Corporation’s not-for-profit parent, the Mozilla Foundation. Portions of this content are ©1998–2025 by individual mozilla.org contributors. Content available under a Creative Commons license.",
        "headline": "Changes in default browser styles for headings",
        "entry_sentence": "Browsers are updating how they handle default styles for <h1> elements.",
        "detail": "Starting from March 31, 2025, Firefox will remove automatic styles for <h1> in nested sections, requiring developers to define their own styles to avoid warnings in tools like Lighthouse.",
        "icon": "🟣"
    }
]