[
    {
        "title": "The dark side of the Moomins",
        "url": "https://www.newstatesman.com/culture/books/2025/04/dark-side-of-the-moomins-tove-jansson",
        "content": "New Times, New Thinking. Books Film TV Music Radio & Podcasts Theatre Goldsmiths Prize Art & Design Q&A Food & Drink Nature Poetry Fiction Sport Search Subscribe Sign In Culture Books 9 April 2025 The dark side of the Moomins Tove Jansson’s beloved stories, which turn 80 this year, are not cute: they are angry tales of apocalypse and breakdown. By Frances Wilson Illustration by Moomin Characters™ “Icould vomit over Moomintroll,” Tove Jansson confided in her notebook in the late 1950s. A decade after the hippo-like creature with low self-esteem made his debut appearance in 1945, Scandinavian homes had become versions of Moominvalley, with Moomin-themed aprons, curtains, wallpaper and crockery, while department stores stocked Moomins modelled in marzipan, ceramic and white leather (Jansson drew the line at Moomin sanitary towels). This world of whimsy bore little relation to the Finnish artist’s initial conception of the Moomintrolls. The Moomins and the Great Flood, the 60-page picture book not translated into English until 2005 and now celebrating its 80th anniversary, was written during the Winter War in 1939, when Russia’s invasion of Finland left 300,000 Finns homeless. (The Moomin estate is marking the anniversary by partnering with Counterpoints Arts and Refugee Week to commission artists to create public artworks inspired by the book.) A tale of displaced people and dangerous predators and living on borders, the first of the nine Moomin books begins with Moomintroll and Moominmamma arriving, “late in the afternoon one day at the end of August”, in “the deepest part of the great forest”. August, Jansson believed, was “the border between summer and winter” and twilight “the border between day and night”. Half-Swedish and half-Finnish, half-storyteller and half-illustrator, a lover of both men and women, and an artist appealing equally to adults and children, Jansson was a border-dweller herself. A scratchy ink illustration on page one shows two tiny dark shapes, which might be roots or rocks, suspended beneath trees the size of Giant redwoods. Mother and son are in search of somewhere “snug” in which to hibernate, but they are also in search of Moominpappa, who long ago disappeared with the “mostly invisible” Hattifatteners: it is striking how many of the characters in Jansson’s stories are searching for something, waiting for something, and in need of a home. The Moomins find another lost creature who will, in the later books, become Moomintroll’s best friend and foster-brother, Sniff. There was a time, Moominmamma tells the small boys, when Moomins made their homes behind the stoves in other peoples’ houses and did not need to “travel through fearsome forests and swamps in order to find somewhere to live”. The Moomin stories were born, Jansson wrote to her friend Eva, “when I was feeling sad and scared of bombs and wanted to get away from gloomy thoughts… I would creep into an unbelievable world where everything was natural and friendly – and possible.” The first book “had to be a fairy tale” with a “happy ending”, and so when the Moomins find Moominpappa they move into his stove-shaped house, which a flood has transplanted, Ark-like, to the valley where they will live, we are told, for “the whole of their lives”. There were no illustrations in Jansson’s first draft of The Moomins and the Great Flood. She had trained as a painter but during the war she “stood still” as an artist and was no longer able to think in colour, so “it felt completely pointless to try to create pictures”. Putting the pages in a drawer, she forgot about them for the next six years until a friend suggested that they could, with pictures, be turned into a children’s book. The Moomins and the Great Flood, illustrated in sepia and black ink, was published only in Sweden, selling 219 copies in the first year. The Moomins, at this point in their gestation, were broad-backed with trunk-like noses, horn-like ears, and flattish stomachs. Their waistlines increased with fame, but their characteristics remained the same: anxious, romantic Moomintroll, dependable Moominmamma, and Moominpappa, the reckless, self-absorbed melancholic whose longing for adventure threatens to destroy them all. Jansson had found her cast, her perfect length – short to medium – and the balance between words and pictures that would prove her genius. The writing is spare, weighed down with silences, the images saying what the words elide. The Moomins and the Great Flood ends with the creation of Moominvalley, the kind of place that the psychotherapist Donald Winnicott – in whom Jansson had a strong interest – would call a “holding environment” where we can be determinedly ourselves. United in solipsism and contained by the love of Moominmamma, the Moomins and their eccentric friends live out their philosophies, compulsions, obsessions, paranoias, and various neuroses. Five further Moomin books followed in quick succession: Comet in Moominland (1946), in which a fireball is seen “diving headlong” towards Moominvalley and the Moomins wait in a cave for extinction (a response to the Soviet bombing of Helsinki and the American bombings of Nagasaki and Hiroshima); Finn Family Moomintroll (1948), a celebration of Jansson’s first affair with a woman, the theatre director Vivica Bandler (“O, to be a newly awakened Moomin dancing in the glass-green waves while the sun is rising”); The Memoirs of Moominpappa, a parody of the life of the 16th-century Italian sculptor Benvenuto Cellini and of male pomposity (“When people read this book,” Moomintroll tells his father, “they are going to believe you are famous”); and Moominsummer Madness (1954), when another flood renders the creatures once again homeless. The sixth novel, Moominland Midwinter (1958), written when Jansson was ready to “vomit” over her creation, contains the most devastating account of depression in 20th-century literature. Waking up early during the annual hibernation, Moomintroll finds himself snowed in and utterly alone in an alien world whose pleasure principle has disappeared. From now on in the books, things get darker. Family relations break down completely in Moominpappa at Sea (1965) when Moominpappa, realising that he is a failed artist, drags his family away from Moominvalley to an uninhabited rock in the middle of the sea that is “completely silent and terribly, terribly cold”. Here, in his attempt to control the waves, he loses his mind, while a desolate Moominmamma hides inside the mural of Moominvalley that she’s painted on the wall and Moomintroll, in love with a seahorse and profoundly depressed, finds a patch of earth on which to sleep. The island, meanwhile, shrinks with unhappiness. Subscribe to The New Statesman today from only £8.99 per month Subscribe The final book, Moominvalley in November (1970), a spin on Waiting for Godot, takes place during the family’s absence. Their friends, not knowing where they have gone or why they left without saying goodbye, wait in the Moomins’ abandoned house (the one in which they would live for “the whole of their lives”) for their return. There is no happy ending, and the readers who drank out of their Moomin mugs and slept beneath their Moomin duvet covers felt angry and cheated. But Jansson, aged 56, was at last free of her Frankenstein’s monster. A book in which nothing happens save the passing of time, Moominvalley in November is an absurdist masterpiece. There is an aesthetic satisfaction to the series, which begins and ends with disappearance. It is Moominpappa who vanishes in the first book, and the entire family in the last. One of the oddest aspects of the Moomin phenomenon is how these complex tales of apocalypse, breakdown and disfunction have been consistently misread as cutesy celebrations of domestic life. Jansson’s characters were a canvas for her own personality traits. Photo by Eva Konikoff Tove Jansson was born in Helsinki in August 1914. Her father, Viktor (known as “Faffan”) was a sculptor from Finland’s Swedish-speaking minority and her mother, Signe Hammarsten (“Ham”) was a well-known draughtswoman, the daughter of a Swedish clergyman. Faffan’s work did not sell and so Ham was the principal breadwinner. By the time she was 14, Tove was also contributing to the family finances by drawing cartoons for the satirical magazine Garm. In her early twenties, her satires of Hitler and Stalin were placed on Garm’s cover. Faffan, who had returned from the Finnish Civil War (January-May 1918) a broken man, now fervently supported Germany and so he and his daughter were at loggerheads. The Janssons saw themselves as bohemians but there is nothing relaxed about the family portrait Tove painted in 1942, which shows five stiff figures in a cramped room, each locked in their own isolation and looking in different directions. Ham and Faffan are in white overalls, one of Tove’s two brothers is in military uniform, while Tove herself, standing in the middle in a black hat, coat and gloves, looks as though her suitcase is packed and she is ready to board a train. “Faffan and I have said we hate each other,” she told a friend during this same year. “It’s hell to be still living at home.” Jansson had lived with Moomins since childhood, when her uncle told her tales about the trolls behind the kitchen stove who would, if she stole jam from the larder, rub their cold snouts against her legs until she froze. By the time she was in her teens the trolls had evolved in her imagination into frightening “house ghosts” who made their presence known by breathing cold air on her neck: “Terrified, I turned the key in the lock and jumped into bed like a shot, and all that night I could hear the Moomintrolls pulling my slippers backwards and forwards under my bed.” Jansson’s first Moomin illustration (“the ugliest thing I could think of”) was on the lavatory wall of the family’s island summer house, where it can still be admired by tourists. The creatures had turned, by her late teens, into what Jansson’s biographer Boel Westin describes as “ominous creatures associated with dreams, confusion and emptiness”, drawn in a series of “expressive landscapes of boulders, seas, dark islands and deserted roads, fenced around with agitation, uncertainty and anguish”. By her early twenties Moomintroll had become Jansson’s “angry signature character”. It is easy to overlook Moomintroll’s anger, which expresses itself largely as fear, but it comes to the surface when his amour propre is challenged, such as in the comic strip story Moomin on the Riviera, where his girlfriend, Snorkmaiden, runs off with the movie star Mr Brisk and Moomintroll challenges him to a duel. The Moomintrolls were first introduced to an English audience in 1954 in the form of a comic strip in the London Evening News (circulation: 12 million) which by 1956 had been syndicated to 120 other papers in 20 further countries. These stories are funnier than those in the books and focus on what Jansson called “psychological moments” and Winnicott would call “nameless dread”. Jansson had inadvertently become the analyst of the postwar psyche, but it was her own psyche she was exploring. The Moomin stories were, she said, “abreactions”, a psychoanalytical term for catharsis (“I abreacted hugely through this book,” she wrote of Moominpappa at Sea), and Jansson distributed herself throughout her characters: she was as dutiful and unassertive as Moomintroll, as misanthropic and frustrated as Moominpappa, as empathetic and reliable as Moominmamma, and as wild as the furious urchin Little My. She hoped that the income from the comic strips would allow her to return to painting, but it became clear by 1957 that this would never happen. As well as containing the world’s fears, Jansson now singlehandedly controlled the Moomin merchandise industry, which involved answering by hand each of the 2,000 letters she received every year. “We look forward to your valued reply soonest concerning Moomin motifs on toilet paper in pastel shades,” reads one letter.” “Hi, my name is Olavi,” reads another. “You write well but last time you did not make a happy ending. Why do you do this?” “What shall I do with my parents?” reads a third. “They’re becoming more and more hopeless. Write!” Jansson, like the Moomins, wanted only to hibernate but instead she found herself snowed in beneath “an avalanche of things”, her world now composed, she said, of “newspapers, telephones, telegrams, post post post in heaps, stacks, avalanches, strangers, lectures, conversations, conversations, masses of words and myriads of children. And never alone. Never ever really alone”. One of the mysteries of Jansson’s personality is why she allowed the mass commercialisation of her delicate, subtle work; another is why, given the urgency of her creative drive, she didn’t employ a secretary to take over the administrative burden. In 1969, around the same time that she completed the Moomin books with Moominvalley in November, Jansson drew her last comic strip and killed off her main character. Moomintroll is diagnosed by a psychiatrist, Dr Schrünkel, with numerous complexes, and prescribed medication which makes him shrink until he completely disappears. The following year, Jansson’s younger brother Lasse took over the cartoons. Moomintroll was now resurrected, after which the stories continued to run until 1975. Tove Jansson is not the first writer to fall out with her characters. Arthur Conan Doyle tried to kill off Sherlock Holmes by throwing him down the Reichenbach Falls, and after 30 years of living with Hercule Poirot, Agatha Christie described him as a “detestable, bombastic, tiresome, egocentric little creep”. What distinguishes Jansson is that she detested her readers even more than her characters. They are satirised in her first cartoon, Moomin and the Brigands, as the hordes of uninvited guests who exploit Moomin’s generosity and, once they have eaten him out of house and home, eat the home itself: “It’s so difficult to tell your guests that you’d like your own bed sometimes,” Moomintroll confides to Sniff. “I must learn to say No”. In 1963, Jansson and her partner, the graphic artist Tuulikki Pietilä, built a cabin on the “angry little skerry” of Klovharu, a rocky and isolated island which could be circumnavigated in four and a half minutes. Even here, where for the next 30 summers she did her best to disappear, she was pursued by boatloads of Moomin fans. “Seven strangers came… to have coffee, drinks and soft drinks and talk and ‘look at me’”, Jansson wrote in her diary. “Kiss my arse… Threw stones. Angry.” Frances Wilson’s “Burning Man: The Ascent of DH Lawrence” is published by Bloomsbury [See also: David Hockney writ large] Content from our partners An old Rioja, a simple Claret,and a Burgundy far too nice to put in risotto New Statesman Wine Club Antimicrobial Resistance: Why urgent action is needed Spotlight The role and purpose of social housing continues to evolve Spotlight Topics in this article : Book reviews , Children's books , Magazine , Moomins This article appears in the 10 Apr 2025 issue of the New Statesman, Spring Special 2025 Frances Wilson Related History Josephine Baker’s French exit Comment What Russia can teach us Books The best books of 2025 so far More from this author See All Frances Wilson The last days of Percy Bysshe Shelley Frances Wilson How Britain changed under Elizabeth II More of this topic Books The best books of 2025 so far Books Samuel Beckett’s art of reduction Books The best children’s books for Easter Recent Podcasts Spotlight on Policy Can the government’s AI Action Plan drive innovation and growth in the UK? Politics podcast A big bad week for money Geopolitics To catch a strongman New Statesman About us History Help Centre Contact us Advertising & Partnerships RSS Social Facebook Instagram Twitter LinkedIn Legal Privacy policy T&Cs New Times New Ideas New Statesman © 2025 Progressive Media Investments We at Progressive Media Investments value your privacy We may store and access personal data such as cookies, device identifiers or other similar technologies on your device and process such data to enhance site navigation, personalize ads and content when you visit our sites, measure ad and content performance, gain audience insights, analyze our site traffic as well as develop and improve our products and services. Further information on the cookies we use and their purpose can be found on our website privacy policy accessible here We use necessary cookies to make our site work. Necessary cookies enable core functionality such as security, network management, and accessibility. You may disable these by changing your browser settings, but this may affect how the website functions. We'd also like to set optional cookies to help us improve our website and help improve your experience whilst on our website. By clicking ‘Accept All Cookies’ you agree to us enabling all optional cookies for these purposes. Alternatively, you can set which optional cookies you wish to enable (and update your preferences including withdrawing your consent) at any time, by clicking ‘Cookie Settings’. We and our 872 partners store and access personal data, like browsing data or unique identifiers, on your device. Selecting \"I Accept\" enables tracking technologies to support the purposes shown under \"we and our partners process data to provide,\" whereas selecting \"Reject All\" or withdrawing your consent will disable them. If trackers are disabled, some content and ads you see may not be as relevant to you. You can resurface this menu to change your choices or withdraw consent at any time by clicking the Manage Preferences link on the bottom of the webpage [or the floating icon on the bottom-left of the webpage, if applicable]. Your choices will have effect within our Website. For more details, refer to our Privacy Policy. We and our partners process data to provide: Use precise geolocation data. Actively scan device characteristics for identification. Store and/or access information on a device. Personalised advertising and content, advertising and content measurement, audience research and services development. List of Partners (vendors) Accept All Cookies Cookie Settings",
        "headline": "Exploring the darker themes of the Moomins",
        "entry_sentence": "Tove Jansson’s Moomin stories, now 80 years old, contain deeper messages about apocalypse and displacement.",
        "detail": "Originally created during the Winter War in Finland, the tales reflect themes of loss and searching for home, contrasting their cute exterior with serious undertones.",
        "icon": "🟣"
    },
    {
        "title": "Why Fennel?",
        "url": "https://fennel-lang.org/rationale",
        "content": "Why Fennel? Fennel is a programming language that runs on the Lua runtime. Why Lua? The Lua programming language is an excellent and very underrated tool. Is it remarkably powerful yet keeps a very small footprint both conceptually as a language and in terms of the size of its implementation. (The reference implementation consists of about nineteen thousand lines of C and compiles to 278kb.) Partly because it is so simple, Lua is also extremely fast. But the most important thing about Lua is that it's specifically designed to be put in other programs to make them reprogrammable by the end user. The conceptual simplicity of Lua stands in stark contrast to other \"easy to learn\" languages like JavaScript or Python--Lua contains very close to the minimum number of ideas needed to get the job done; only Forth and Scheme offer a comparable simplicity. When you combine this meticulous simplicity with the emphasis on making programs reprogrammable, the result is a powerful antidote to prevailing trends in technology of treating programs as black boxes out of the control of the user. And yet... So if Lua is so great, why not just use Lua? In many cases you should! But there are a handful of shortcomings in Lua which over time have shown to be error-prone or unclear. Fennel runs on Lua, and the runtime semantics of Fennel are a subset of Lua's, but you can think of Fennel as an alternate notation you can use to write Lua programs which helps you avoid common pitfalls. This allows Fennel to focus on doing one thing very well and not get dragged down with things like implementing a virtual machine, a standard library, or profilers and debuggers. Any library or tool that already works for Lua will work just as well for Fennel. The most obvious difference between Lua and Fennel is the parens-first syntax; Fennel belongs to the Lisp family of programming languages. You could say that this removes complexity from the grammar; the paren-based syntax is more regular and has fewer edge cases. Simply by virtue of being a lisp, Fennel removes from Lua: statements (everything is an expression), operator precedence (there is no ambiguity about what comes first), and early returns (functions always return in tail positions). Variables One of the most common legitimate criticisms leveled at Lua is that it makes it easy to accidentally use globals, either by forgetting to add a local declaration or by making a typo. Fennel allows you to use globals in the rare case they are necessary but makes it very difficult to use them by accident. Fennel also removes the ability to reassign normal locals. If you declare a variable that will be reassigned, you must introduce it with var instead. This encourages cleaner code and makes it obvious at a glance when reassignment is going to happen. Note that Lua 5.4 introduced a similar idea with <const> variables, but since Fennel did not have to keep decades of existing code like Lua it was able to make the cleaner choice be the default rather than opt-in. Tables and Loops Lua's notation for tables (its data structure) feels somewhat dated. It uses curly brackets for both sequential (array-like) and key/value (dictionary-like) tables, while Fennel uses the much more familiar notation of using square brackets for sequential tables and curly brackets for key/value tables. In addition Lua overloads the for keyword for both numeric \"count from X to Y\" style loops as well as more generic iterator-based loops. Fennel uses for in the first case and introduces the each form for the latter. Functions Another common criticism of Lua is that it lacks arity checks; that is, if you call a function without enough arguments, it will simply proceed instead of indicating an error. Fennel allows you to write functions that work this way (fn) when it's needed for speed, but it also lets you write functions which check for the arguments they expect using lambda. Other If you've been programming in newer languages, you are likely to be spoiled by pervasive destructuring of data structures when binding variables, as well as by pattern matching to write more declarative conditionals. Both these are absent from Lua and included in Fennel. Finally Fennel includes a macro system so that you can easily extend the language to include new syntactic forms. This feature is intentionally listed last because while lisp programmers have historically made a big deal about how powerful it is, it is relatively rare to encounter situations where such a powerful construct is justified. For a more detailed look at the guiding principles of Fennel from a design perspective see the Values of Fennel. Home source for this site",
        "headline": "Introduction of Fennel programming language",
        "entry_sentence": "Fennel is a programming language that operates on the Lua runtime.",
        "detail": "It simplifies Lua's syntax and helps avoid common pitfalls while keeping the powerful features of Lua intact.",
        "icon": "🟣"
    },
    {
        "title": "I bought a Mac",
        "url": "https://loganius.org/2025/04/i-bought-a-mac/",
        "content": "Skip to content Loganius' Site My Things I bought a Mac. Apr 13, 2025 — by loganius in Tech Shenanigans Yep. I regret to inform you all that, as of January 2025, I am a Mac user: I bought a Mac. I have betrayed the penguin. Behold: My shame. What? Yes. The first Mac I have ever owned: this beautiful beast, a PowerMac G4 MDD: specifically a top-of-the-line dual 1.25 GHz FireWire 400 model circa 2002. Here’s the full specs if you’re curious. So, how did such an icon of early 2000s Apple fall into my grubby hands? Well, it all started with the Wii U. I’m not joking. For a while now, I have been working intermittently on the Wii U Linux kernel. In December, for reasons that aren’t important right now3, I turned my attention towards fixing KVM on the Wii U, but in order to fix it, I needed to figure when and why it broke, and the easiest way I could think to do that was with a PowerMac.4 Fortunately, my roommate already had a 233 MHz Bondi Blue iMac G3, which he very kindly agreed to lend me. However, when I tried to use it, it was so slow that I couldn’t even get Linux installed. After that, I decided I’d rather get crushed by a crane then do kernel debugging on a 233 MHz G3. I realized, somewhere, something needed a change.5 That’s when CursedSilicon6 stepped in. He owned not one, but two PowerMac G4 MDDs, one of which he very kindly offered to sell to me for the low low price of $0 (plus shipping). Did I mention G4 MDDs are very heavy? … $91 and a few days later, the husk of a PowerMac was now under way. Yes, according to him, someone stole the RAM, hard drive, and PRAM7 battery out of the G4 before he shipped it to me! Apparently parts just… float around the hacker space he kept it in?! I had hoped they would turn up before he shipped it, but alas, they did not. Time to go internet spelunking. COMPUTER REPAIR: THE GAME You find yourself in a dark house. You search your person and find nothing but a debit card and a luminescent tablet. Staring into the ceaseless abyss, suddenly you remember: you have parts to acquire for your new computer. LEVEL 1 HARD DRIVE You already have several IDE hard drives in the garage, one of which you have already tested and confirmed to be in good condition. LEVEL COMPLETE LEVEL 2 PRAM BATTERY The PowerMac does not take a standard CR2032 coin cell; instead, it takes a 1/2 AA, which you never heard of before. What do you do? > go to amazon You find a 1/2 AA battery for $8. Seems like a little much, but this is kind of a specialty battery. What do you do? > buy it It will not arrive until after the computer. Fortunately, you do not need a battery to use the computer. You decide to install it whenever it shows up, and move on to other issues. LEVEL COMPLETE LEVEL 3 RAM The PowerMac takes up to 4 sticks of standard PC-2700 DDR1 RAM, up to a total of 2GB. Perhaps once upon a time, you had some of this type of RAM, but if you did, it's long gone, and without it, you cannot use the computer. What do you do? > go to ebay There are many listings for DDR1 RAM on eBay, some of which are reasonably priced, while others are prohibitively expensive. You can't tell for certain whether any given set will work with your PowerMac. What do you do? > im feeling lucky babyyyyy You stumble upon a listing for lots of four 512MB non-ECC DDR1 RAM sticks. It seems perfect. Just one problem: they’re of “various brands”. You have no way of knowing whether the 4 you get will match. But you’re feeling lucky, so you roll the dice. ... The sticks arrive just before the computer. You excitedly tear open the package and inspect them. To your delight, they’re a perfect match: 4 identical 512MB Kingston sticks. You step back and bask in the feeling that luck was on your side. LEVEL COMPLETE. The computer arrives. Hurriedly, you put in the RAM, plug in the power and video, and turn it on. You are greeted by a flashing folder. You acquired: (1x) Working PowerMac G4 MDD. Amazingly, I seem to have not taken a single photo during this entire process. In fact, I had to go back and get a photo of that screen for this post. It’s a well-worn stereotype that people of my generation are addicted to taking photos of everything and nothing, but clearly I do not fall into that trope. It’d be really convenient right now if I did, though. The fun didn’t stop there though; it was just getting started! Because very quickly I realized why the PowerMac G4 MDD has a reputation as “the windtunnel Mac”: this thing is loud! Something which I was unaware of before buying it. By this point, however, I was in far too deep to turn back, so I needed to find a way to temper the beast. I thought it would be easy: I’d just lubricate the ancient, notoriously loud system fan; except I came up with bright idea to take apart the fan so I could lubricate it properly. I then immediately snapped the clasp which held the rotor to the axle, killing the fan. And the worst part? Once it was dead, I discovered the system fan wasn’t even the problem: it was the power supply fans, meaning I wrecked the poor thing for nothing, and I now had a major problem I got to fix. sigh. Back to Amazon. Fortunately, the G4’s fan was a standard size: 120mm, meaning I wasn’t totally out of luck. However, due to the MDD’s uniquely terrible thermal design, it requires a stupidly high flow rate fan to keep it cool, meaning I had to go out of my way to find one comparable to the behemoth I’d just destroyed. So, how much airflow did I need? According to what I read online, at least 80 CFM8. For some reason, I decided to only look at Noctua fans, and their only 120mm fan that did at least 80CFM was the beefiest, fastest, and noisiest fan in their entire lineup: the 3000 RPM version of the NF-F12 Industrial PPC, moving 186.7 m3/h of air (109.9 CFM), and rated for 43.5 db of noise. Despite my concerns that it would be just as loud as the old fan, I bought it, alongside two 60mm fans for the power supply. In the meantime, I took to leaving the G4 open with a desk fan pointed at it so I could keep using it without it exploding. Soon enough, my beautiful new tan-and-beige Noctua fans arrived, meaning it was time to install them, except this is an Apple product, so it couldn’t be that simple. Instead of standard 4 pin fan headers, the PowerMac G4 MDD uses 2 pin fan headers, meaning I was going to have to salvage the the old fans’ connectors. What could possibly go wrong? I decided to tackle the system fan first. I felt I was desecrating a grave as I pulled out the remains of the original fan and snipped off the last few inches of its cable, then the end of the new fan’s cable. To connect them, I had the pleasure of dealing with heat shrink butt connectors! Why not use crimps? Because I didn’t have any in the right size. It was nerve-racking delicately torching the connector while trying not to burn myself or the cable, but I managed it. With that, operation number 1 was complete, leaving me with what I had been dreading: the power supply. Now, electricity is not the boogeyman: you can open a power supply safely, you just have to be aware of the dangers inside. First, never open a running power supply: if you accidentally touch something at high voltage, you could die. However, even if you unplug it first, that doesn’t mean it’s safe because of these: Credit: Hans Haase, CC BY-SA 3.0, via Wikimedia Commons Capacitors. Capacitors can hold charge for a long time, so no touchy. It probably wouldn’t kill you, because capacitors don’t actually store that much energy9, but that doesn’t mean it couldn’t kill you, so, no touchy! That being said, I was likely never in any real danger, because by the time I opened up PowerMac’s power supply, it’d been unplugged for several hours, meaning the capacitors were likely already fully discharged. Still, I treated the capacitors as if they were charged, because, despite the state of the world at the moment, I do, in fact, enjoy being alive, and I’d rather stay that way. But none of that mattered until I got into the dang thing, because it took me an embarrassingly long time to figure out how to open the power supply. (Turns out the top half of the case slides off once you take out all the screws. Who knew?) Upon doing so, I discovered that all of the wires inside, including the ones for the fans, were zip-tied together! Amazing! It was absolutely infuriating trying to maneuver a sharp instrument through the tight space and into the minuscule margin left by the factory on the zip ties, without breaking something. I was eventually able to shove the end of a pair of scissors through the loop of the tie, then twist until the plastic gave way, but it was such a pain. At least now, after a bit of unplugging and unscrewing, the old fans were finally free. I then went through the same splicing process as the system fan for each of the 2 new power supply fans. But once that was done, the hard part was finally over, or at least I assumed. Unbeknownst to me, however, this computer had one last rage inducing quirk left in store for me: the new fan’s cables were too thick to fit. It took a good 10 minutes of me struggling to shove everything through before I was able to plug everything in and close the power supply. With that, at long last, the repair was complete; and all this over a broken sliver of metal. I hesitantly took the PowerMac back upstairs, plugged it in, and pressed the power button. It turned on, but confusingly without so much as a peep from the fans; of course, just as I started to fear I’d somehow broken them, they whirred to life, and I soon discovered, to my horror, that my new Noctua fan was just as loud as the original when running at full blast, which it did, every few minutes, preventing me from falling asleep at night if I make the mistake of leaving it on. so worth it And just as I had shut down the PowerMac and got ready to go to bed, I had one last devastating realization: I had once again gone about fixing the system fan in the dumbest way possible. Rather than using the extension cord that came in the box!!, I had spliced the cable directly off the fan. Instead of gaining the ability to easily replace the fan in the future if I should ever want to, for some reason, I had bound myself to use this poor, innocent Noctua fan in the G4 until it died, no matter what. Oh, by the way, between when I bought the PowerMac and when it arrived, somebody else10 fixed the bug preventing KVM from working on the Wii U. (ノಠ益ಠ)ノ彡┻━┻ ┬─┬ノ( º _ ºノ) Well, guess I’m stuck with it now: gotta figure out what I’m gonna do with it. Oh wait, I already did, because this all happened 4 months ago; expect blog posts about what I’m up to on the G4 in the future. For now, that’s all I have for you. Working with this PowerMac has been equally fun and frustrating, not to mention expensive, but it has been nice to play around with PowerPC Mac OS, and to experience what was once the bleeding edge of consumer computing. Besides, the thing’s beautiful: I mean, how can you not love this monstrosity? Isn’t it glorious? See you next time. -Loganius. 🙂 Featured Macintosh image: http://www.allaboutapple.com/, CC BY-SA 2.5 IT, via Wikimedia Commons Star pattern added by Logan C. I did not upgrade the optical drive. It came with a DVD-RW drive, despite Wikipedia saying the mid 2002 G4 MDD came with a DVD-R drive. Either Wikipedia is wrong, or someone already upgraded the optical drive in this G4. ↩︎ I’m referring to the fact that the G4 came with little more than the case, motherboard, and disc drive. ↩︎ There was talk among the kernel devs at the time about dropping support for KVM on 32 bit platforms altogether. That would have been horrible news for us in the PowerPC community, because the Wii, Wii U, and almost all PowerMacs are 32bit, so we concocted a plan to demonstrate as many use cases for KVM on 32 bit as possible, in the hopes of convincing the kernel devs to keep it around. However, before I could show KVM doing something useful, I had to get it doing something at all, hence: the need to fix KVM on the Wii U. ↩︎ The Wii U is a PowerPC machine; specifically, its CPU is a derivative of a derivative of a derivative of the PowerPC 750, also known as the G3. My plan was to bisect the issue using a PowerMac because they’re supported by upstream, and thus I could build and test any kernel commit using a PowerMac, whereas on the Wii U, I could only easily test full kernel releases ported to the Wii U. I probably could have found a way to test each individual commit on the Wii U if I’d had to, but I really didn’t want to. ↩︎ “Sadness is hanging there / To show love somewhere something needs a change, they need a change / THEY’LL NEED A CRANE” ↩︎ By the way, CursedSilicon has his own website which you should absolutely check out. It has more information about himself, his 2 PowerMacs (including the one I bought), his other projects, and all the other computers in his collection. ↩︎ As far as I know, PRAM is the PowerMac’s equivalent of CMOS: it stores firmware settings and the system time, except that PRAM does it in a much more structured and standardized way, to the point that 3rd party utilities can and do reliably modify PRAM. Also, in talking to CursedSilicon after it arrived (because that’s when I found out it had no PRAM battery), he told me it was likely removed by RePC before he bought it, rather than stolen, but small details like that can detract from the overall flow of the post: hence, rather than taking the time out of the main article to include them, I have footnotes. ↩︎ Cubic feet per minute. ↩︎ When I was preparing to swap out the fans, I actually calculated how much energy the capacitors inside the PowerMac G4’s power supply likely held. The 3 main power filtering capacitors (the scary ones) are each 100 µF, and at 170v (the peak-to-peak voltage of wall power here in North America), combined they hold about 4.5J of energy, roughly the amount needed to run a 40w incandescent equivalent LED light bulb for 1 second. Not that much energy. ↩︎ That somebody else was Anna Wilcox, proprietor of Wilcox Technologies Inc and lead developer of Adélie Linux. She had been contracted to fix KVM on PPC64, and had identified a bug caused by a change in GCC. It turns out bug also existed on PPC32, and was the cause of the issue I had been trying to fix. She was also in that thread about dropping KVM on 32 bit platforms I mentioned in footnote 1. ↩︎ Grass Macintosh PowerMac PowerPC TMBG Reference Comments Leave a Reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. ←Previous: Hello world! Loganius' Site my home on the interwebs wave it with pride By Benson Kua, CC BY-SA 2.0, Link Designed with WordPress Log In",
        "headline": "Loganius shares experience of becoming a Mac user",
        "entry_sentence": "Tech enthusiast Loganius has transitioned to a Mac by purchasing a PowerMac G4 MDD.",
        "detail": "He details the challenges and joys of repairing the vintage computer, including fan issues and sourcing parts.",
        "icon": "🟣"
    }
]