[
    {
        "title": "Nice things with SVG",
        "url": "https://fuma-nama.vercel.app/blog/svg-art",
        "content": "Projects Playground Blog # SVG More about SVG. Note that the example code is written in JSX (or React), not ordinary HTML. # Animated Wires Make the line, using line or path. <svg viewBox=\"0 0 50 50\" className=\"bg-neutral-900 max-w-[100px] mx-auto\"> <g> <line x1=\"0\" y1=\"0\" x2=\"0\" y2=\"50\" stroke=\"white\" strokeWidth=\"1\" /> </g> </svg> Make it a mask. <svg viewBox=\"0 0 50 50\" className=\"bg-neutral-900 max-w-[100px] mx-auto\"> <g> <rect x=\"0\" y=\"0\" width=\"50\" height=\"10\" fill=\"red\" mask=\"url(#line)\" /> <mask id=\"line\"> <line id=\"\" x1=\"0\" y1=\"0\" x2=\"0\" y2=\"50\" stroke=\"white\" strokeWidth=\"1\" /> </mask> </g> </svg> Add animation. <svg viewBox=\"0 0 50 50\" className=\"bg-neutral-900 max-w-[100px] mx-auto\"> <g> <rect x=\"0\" y=\"0\" width=\"50\" height=\"10\" fill=\"red\" mask=\"url(#animated_line)\" style={{ animation: \"to-down linear infinite 2s\", }} /> <mask id=\"animated_line\"> <line x1=\"0\" y1=\"0\" x2=\"0\" y2=\"50\" stroke=\"white\" strokeWidth=\"1\" /> </mask> </g> </svg> @keyframes to-down { 0% { transform: translateY(-10px); } 100% { transform: translateY(50px); } } Make styles. <svg viewBox=\"0 0 50 50\" className=\"bg-neutral-900 max-w-[100px] mx-auto\"> <g> <line x1=\"0\" y1=\"0\" x2=\"0\" y2=\"50\" stroke=\"rgb(50,50,50)\" strokeWidth=\"2\" /> <rect x=\"0\" y=\"0\" width=\"100%\" height=\"20\" fill=\"url(#line_color)\" mask=\"url(#animated_line_fancy)\" style={{ \"--height\": \"20px\", animation: \"to-down-2 linear infinite 3s\", }} /> <defs> <linearGradient id=\"line_color\" x1=\"0\" x2=\"0\" y1=\"0\" y2=\"1\"> <stop offset=\"0%\" stopColor=\"rgba(255,0,255,0.1)\" /> <stop offset=\"100%\" stopColor=\"rgb(255,100,255)\" /> </linearGradient> </defs> <mask id=\"animated_line_fancy\"> <line x1=\"0\" y1=\"0\" x2=\"0\" y2=\"50\" stroke=\"white\" strokeWidth=\"2\" /> </mask> </g> </svg> @keyframes to-down-2 { 0% { transform: translateY(calc(var(--height) * -1)); } 100% { transform: translateY(100%); } } Most of these similar things are using the same technique. Mask out an animated block, putting some animations and probably designed some parts in Figma or other SVG editors. Unkey's landing page is a nice example. # Clerk TOC I made a clerk-like style Table Of Contents (TOC) on Fumadocs, you can try it out and play with the nice TOC. To implement it, we have to render the TOC outline on server, without client-side JavaScript to make it compatible with SSR. Since we're on server, we don't know the exact positions of elements. My approach is to use absolute positions, render the outline as different \"components\", and snitch them together. This isn't hard, but we also want to render a highlighted part of outline where the items are active, or their corresponding heading is visible in the viewport. Like: I'll call it the thumb. It has to be animated, so we can't just change the color of these outline components. We cannot animate the thumb with simple CSS solutions, lucky we have the exact rendered positions of TOC items, since the thumb is meant to be interactive, it is rendered on client! Using the information from our browser, we can construct a \"mask map\" on client, look like this: The method to construct this map is SVG - yes, our old friend. <svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 14 236\"> <path d=\"M1 0 L1 20 L13 36 L13 56 L1 72 L1 92 L13 108 L13 128 L1 144 L1 164 L1 180 L1 200 L13 216 L13 236\" stroke=\"white\" strokeWidth=\"1\" fill=\"none\" /> </svg> The d property of SVG <path /> isn't a nonsense auto-generated string, it's a list of commands. See the Web Docs for more details, it's quite a powerful tool. With our new tool, we can tell SVG to render a line connecting each point of the outline. This constructed a SVG that's identical to our original TOC outline pre-rendered on server. Similar to the technique we've learnt from Animated Wires, we can use the CSS mask-image property to mask an animated div block to render the thumb - a highlighted part of outline. <div style={{ maskImage: `url(\"data:image/svg+xml,${ // URI encoded SVG image encodeURIComponent( `<svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 14 236\">...</svg>` ) })`, }} > <div style={{ width: 1, height: thumb.height, transform: `translateY(${thumb.top}px)`, transition: \"all 500ms\", backgroundColor: \"white\", }} /> </div> Check the source code to see my implementation in React.js. Huge thanks to Clerk for inspiring me on this, I've never thought the TOC of a documentation site can be that interesting to play with. Last Updated:Tuesday, August 20, 2024 Fuma Nama An open-sourcerer. Back to blog Sign In Pablo Fernandez Today 11:43 Thanks for the post! 1 Hoàng Chí Lâm 12/03/2025 16:33 Thank you for your nuggets of knowledge 1 Hong 20/07/2024 17:35 I learned something new! 🔥 6 1 Replies",
        "headline": "Innovative SVG Techniques for Interactive ToC",
        "entry_sentence": "A blog discusses advanced SVG methods for creating an interactive Table of Contents (ToC).",
        "detail": "The author explains how to render the ToC on the server while ensuring it remains functional and animated on the client side, utilizing SVG for dynamic visual elements.",
        "icon": "🟣"
    },
    {
        "title": "Experimental release of GrapheneOS for Pixel 9a",
        "url": "https://grapheneos.social/@GrapheneOS/114327666433966529",
        "content": "grapheneos.social is one of the many independent Mastodon servers you can use to participate in the fediverse. GrapheneOS server for official project accounts and project members. ADMINISTERED BY: admin @admin SERVER STATS: 3 active users grapheneos.social: About · Status · Profiles directory · Privacy policy Mastodon: About · Get the app · Keyboard shortcuts · View source code · v4.3.7 Back GrapheneOS @GrapheneOS@grapheneos.social Our initial highly experimental release for the Pixel 9a is now available for both CLI and web install via https:// staging.grapheneos.org/ . We've tested both install methods and did basic testing of functionality including Wi-Fi, camera, audio, etc. Feedback is needed from users now. GrapheneOS GrapheneOS: the private and secure mobile OS GrapheneOS is a security and privacy focused mobile OS with Android app compatibility. Apr 13, 2025, 01:49 AM · · Web Last edited Apr 13, 02:11 AM 13 boosts · 25 favorites 13h GrapheneOS @GrapheneOS We've tested the over-the-air upgrade path for the Pixel 9a internally via a sample update with no changes. We usually only use these sample updates internally for testing the upgrade path of each release. However, for broader testing, we're releasing it through each channel now. 1 12h GrapheneOS @GrapheneOS First update from the initial 2025041200 release to the new 2025041201 release has no changes beyond build date and build number. The incremental (delta) update package is only 158KiB despite it shipping the full new firmware and OS images. We tested a full update package too. 1 12h GrapheneOS @GrapheneOS Basic functionality has been tested for a while along with the upgrade path via both our System Updater app and recovery. It no longer needs to be considered highly experimental. Therefore, experimental Pixel 9a releases are now available on our regular production website too. 1 9h GrapheneOS @GrapheneOS All of the standard Android and GrapheneOS functionality should already be working on the Pixel 9a including our hardware-based USB-C port control feature, hardware memory tagging, etc. Main work was dealing with the temporary QPR1-based device branch ( https:// grapheneos.social/@GrapheneOS/ 114320149441258698 ). 2 8h Autistic Nerd @Nerd_JAC@aethy.com @GrapheneOS glad to hear. Mine gets delivered either Wednesday or Thursday 0 6h Olli @vidar@social.tchncs.de @GrapheneOS Great work! Thank you! 0 13h J. Ling @jling@m.jling.dev @GrapheneOS that's fast 0 10h nmne @nmne@fosstodon.org @GrapheneOS 0 6h benrutter @benrutter@mastodon.green @GrapheneOS Yowza that's fast- kudos to everyone involved! 0 Search Live feeds Mastodon is the best way to keep up with what's happening. Follow anyone across the fediverse and see it all in chronological order. No algorithms, ads, or clickbait in sight. Create account Login",
        "headline": "GrapheneOS releases initial version for Pixel 9a",
        "entry_sentence": "GrapheneOS has launched its first experimental release for the Pixel 9a device.",
        "detail": "Both command line and web install options are available, and the project is seeking user feedback on functionality.",
        "icon": "🟣"
    },
    {
        "title": "BPS is a GPS alternative that nobody's heard of",
        "url": "https://www.jeffgeerling.com/blog/2025/bps-gps-alternative-nobodys-heard",
        "content": "Skip to main content Jeff Geerling Main menu Merch About Blog Projects BPS is a GPS alternative that nobody's heard of April 8, 2025 I came to the NAB (National Association of Broadcasters) show this year with my Dad to learn more about time in broadcast and live production. I was expecting to learn more about grandmaster clocks, AV sync, timing in protocols like Dante, Livewire, AES67, and more—and I have. But then on the first day here I found this odd little corner of the building with a completely empty booth: When you see an oscilloscope that costs 3x the value of your car on a trade show floor... well, let's just say my interest was piqued. I looked at it, and found something interesting—the trigger was on a GPS PPS timing signal output from a u-blox GPS receiver. But the 2nd channel was monitoring KSNV-TV, a US television station broadcasting an ATSC 3.0 signal. The scope showed a PPS output (Pulse Per Second) demonstrating a pulse sync of +/- 10 ns between GPS and the TV signal output—which so happens to be BPS, an experimental timing standard that may be incorporated into the ATSC 3.0 rollout in the US (there are currently about 1,700 TV stations that could be upgraded). After seeing the demo, I found out there are a few people who've heard of BPS... and many of them were presenting on it, as they were also the ones who were doing the initial rollout and experimentation. ATSC 3.0 is a newer IP broadcast standard being rolled out in some countries—my own home city has two TV stations broadcasting it right now, under the 'NEXTGEN TV' moniker. But so far only a few TV stations are participating in the BPS testing. Because accurate timing is critical in many areas, from media, to the power grid, to 5G and communications, having a reliable terrestrial backup to GPS—especially one that can be hardened against different types of jamming attempts—may be important to our economy, communications and power grid... or people like who just want to have a good time! And speaking of time stuff at the NAB Show... can you guess what I'm pointing to in this photo, from the ASUS booth? If you guessed built-in PPS in/out connectors on a consumer Intel motherboard that syncs to TGPIO (Time-Aware GPIO) on an Intel CPU... you'd be right! And if you have no clue what that means, well, I'll cover it more in depth later this year :) Anyway, I am still learning about BPS, so I'll probably go deeper into it later in my timing series on my YouTube channel, but for now, I'll leave with with a quick video showing the demo (below), and a couple links for those who want to learn more: More resources: BPS / NIST time experiment results NAB PILOT - BPS Info UrsaNav's eLoran timing Further reading Time Card mini adds Pi, GPS, and OCXO to your PC PTP and IEEE-1588 hardware timestamping on the Raspberry Pi CM4 Raspberry Pi cluster spotted inside $6k audio processor time timing broadcast nab bps gps location Add new comment Comments Tom – 4 days ago bps space (YouTube rocket channel) had a bps GPS on his meat rocket (yes!) in his latest video and just said, don't worry about it :D interesting reading about it here! reply Bjorn Madsen – 2 days ago In reply to bps space (YouTube rocket… by Tom Going to go look up meat rocket here after turning off NSFW search results. reply Jon – 3 days ago This reminds me of an astronomy research project I worked on way back in the late 1980s. The project involved driving round the UK with a radio telescope in a van, setting it up in various locations and using something called aperture synthesis to observe and image distant quasars (I won't explain the terms, you can google them). One of the problems we had is that the clocks on the portable telescope had to be very precisely synchronized with the clocks on the larger, fixed 'base' telescope. The lower cost atomic clocks we had would drift too much, so the solution was to digitise signals from a high-power broadcast FM radio transmitter at the two receivers, then cross-correlate the signals to get high-precision relative timing. I seem to remember the solution was good for + or - a few nanoseconds. This didn't get you absolute time, but it avoided relative drift between the two ends. There was nothing extra or clever broadcast along with the FM radio transmission. As long as the two receivers were receiving the same thing, you could keep the clocks in sync. There was a related initiative to record several transmitters at once and use triangulation to get accurate positioning. Again no special transmissions required - you just had to cross-correlate the signals from a base-station and mobile unit to get accurate positioning. reply Carl Cooper – 2 days ago Thanks for putting this video up and double thanks for doing it so quickly. I also came across that booth on Sunday when I arrived at the convention and my first impression was that it could be an excellent backup for GPS! I was able to speak with Harvey Arnold, Senior Vice President Engineering at the Sinclair Broadcast Group. We were able to discuss some technical details of the system and I suggested that it might be an excellent backup for aviation GPS applications. I then discovered that Mr. Arnold is also a pilot and mentioned that that is one possible use for the BPS system. As a brief background, aircraft navigation and safety relies heavily on GPS. However unlike the multitude of other things which we need to safely fly, GPS has no backup which provides the same capabilities. When it goes down, the entire commercial and private aircraft communities revert to 1950's VOR and other old technology radio navigation. This seriously affects aircraft navigation. Having a GPS backup which provides the same capabilities for aviation would be a great safety improvement for the industry. FYI, I mentioned this article via email to Jay Wiles, Director, Public and Media Relations, AOPA and his comments back to me about BPS included \"But this is a whole new kind of impressive. I will absolutely pass along your email to all of the leaders of our publications, digital, and video teams. I will also send it to our government advocacy team in D.C. as well.\" reply All content copyright Jeff Geerling. As an Amazon Associate I earn from qualifying purchases. Top of page.",
        "headline": "Exploring BPS Timing Standard at NAB Show",
        "entry_sentence": "Jeff Geerling discovered an innovative timing standard called BPS at the NAB Show.",
        "detail": "BPS may serve as a reliable terrestrial backup to GPS, which is crucial for various sectors including media and aviation.",
        "icon": "🟣"
    }
]