[
    {
        "title": "Cursor IDE support hallucinates lockout policy, causes user cancellations",
        "url": "https://old.reddit.com/r/cursor/comments/1jyy5am/psa_cursor_now_restricts_logins_to_a_single/",
        "content": "jump to content MY SUBREDDITS POPULAR-ALL-USERS | ASKREDDIT-PICS-FUNNY-MOVIES-GAMING-WORLDNEWS-NEWS-TODAYILEARNED-NOTTHEONION-EXPLAINLIKEIMFIVE-MILDLYINTERESTING-DIY-VIDEOS-OLDSCHOOLCOOL-EUROPE-TWOXCHROMOSOMES-TIFU-MUSIC-BOOKS-LIFEPROTIPS-DATAISBEAUTIFUL-AWW-SCIENCE-SPACE-SHOWERTHOUGHTS-ASKSCIENCE-JOKES-IAMA-FUTUROLOGY-SPORTS-UPLIFTINGNEWS-FOOD-NOSLEEP-CREEPY-HISTORY-GIFS-INTERNETISBEAUTIFUL-GETMOTIVATED-GADGETS-ANNOUNCEMENTS-DE_IAMA-WRITINGPROMPTS-PHILOSOPHY-DOCUMENTARIES-BUNDESLIGA-EARTHPORN-PHOTOSHOPBATTLES-LISTENTOTHIS-BLOG MORE » reddit.com cursorcommentsother discussions (1) Want to join? Log in or sign up in seconds. this post was submitted on 14 Apr 2025 69 points (87% upvoted) shortlink: Submit a new link Submit a new text post Get an ad-free experience with special benefits, and directly support Reddit. Get Reddit Premium cursor join47,040 readers 758 users here now a community for 1 year MODERATORS MESSAGE THE MODS discussions in r/cursor <> X 19 · 19 comments What are the best security practices? Welcome to Reddit, the front page of the internet. BECOME A REDDITOR and join one of thousands of communities. × This post is locked. You won't be able to comment. 69 PSA: Cursor Now Restricts Logins to a Single Machine (self.cursor) submitted 1 day ago * by BrokenToasterOven [removed] 59 commentssharesavehidereport all 59 comments sorted by: best Want to add to the discussion? Post a comment! CREATE AN ACCOUNT [–]mntruellDev [score hidden] 1 day ago stickied comment Hey! We have no such policy. You're of course free to use Cursor on multiple machines. Unfortunately, this is an incorrect response from a front-line AI support bot. We did roll out a change to improve the security of sessions, and we're investigating to see if it caused any problems with session invalidation. We also do provide a UI for seeing active sessions at cursor.com/settings. Apologies about the confusion here. permalinkembedsavereportreply [–]ThreeKiloZero 29 points 1 day ago I’m seeing less and less value in cursor as an IDE. It was ahead of the game for a while but they seem to have lost their way and got stuck. The docs feature doesn’t seem to work. The max features make way too many tool calls. There’s no more innovation coming from them, just shitty billing practices. I guess that’s what happens when you start taking big funding rounds. There’s lots of pressure to show income. It feels like both cursor and windsurf are kind of dead in the water now. Jetbrains has Junie which is as good an agent as either of them. Roo code is pushing faster and better updates than Cline. I dare to say copilot has seen the light as well. I can’t really think of a reason to pay for cursor anymore. There’s Claude code and augment, and aider and the list of capable alternatives is getting longer. permalinkembedsavereportreply [–]BrokenToasterOven[S] 7 points 1 day ago* I literally just cancelled my sub and moved to AUGMENT CODE. I was dumping like $700/wk into Cursor through work, and now we're purging it completely. permalinkembedsaveparentreportreply [–]WholeMilkElitist 5 points 1 day ago Only a matter of time before the enshittification began, cursor is just further along the curve than I expected. I think VSCode will eat their lunch and the people with serious cash to burn will use the tools that require an API key. permalinkembedsaveparentreportreply [–]malachi347 4 points 1 day ago I haven't seen this behavior today but if I did that might be a deal breaker for me. And I think what would bother me the most is if there was no mention of this on their site, and like OP said, no session management - not having even a basic warning and the *chance* to rdp into the other machine and properly close a session would be disastrous to the way in which I conduct business and utilize Cursor. I'm also pretty loyal (probably a better word than that but) to companies I like enough to spend money on. But I am a freelancer and work during the day at my office and at night at home. permalinkembedsaveparentreportreply [–]DogAteMyCPU 2 points 1 day ago They are trying to set up a moat so they remain in the lead by default. I dont think it will work for them. permalinkembedsaveparentreportreply [–]premiumleo 1 point 1 day ago i don't think a moat is possible for anyone in this game. it's moving WAY too fast imo. permalinkembedsaveparentreportreply [–]Suspicious_Yak2485 1 point 1 day ago I just stick with Cursor because of the price. If Roo somehow could work on a flat fee model (under $60/month) they'd destroy Cursor in a day. (Of course, I don't think they could do such a model without like $100 million in investment injected.) permalinkembedsaveparentreportreply [–]_web_head 29 points 1 day ago This is nuts. Atleast have 2 or 3 devices minimum. No real corporate developer just have the work laptop. They'd atleast have a personal one permalinkembedsavereportreply [–]BrokenToasterOven[S] 1 point 1 day ago Like, bro, Trae AI IDE is literally free, and they're pulling this? They have people offering their capabilities for literally 0 dollars, and us paying customers are getting the royal screwjob. 😭😭 permalinkembedsaveparentreportreply [+][deleted] 1 day ago* (1 child) [–]BrokenToasterOven[S] 17 points 1 day ago I'm out, that's it, they have taken too much, asked too much, and given us too little. We are getting core features taken away daily. Goodbye, gang. I suggest getting off this ship while you can. <image> permalinkembedsavereportreply [–]MacroMeezDev 9 points 1 day ago This doesn’t seem right, both the issue and policy reply. Seems more like an anti-fraud measure bug Looking into it permalinkembedsaveparentreportreply [–]BrokenToasterOven[S] 3 points 1 day ago If that's the case, I genuinely appreciate you taking the time. Thank you. permalinkembedsaveparentreportreply [–]nfrmn 2 points 1 day ago Sam is an AI not a real person so it might be saying the wrong thing permalinkembedsaveparentreportreply [–]BrokenToasterOven[S] 1 point 1 day ago Yeah, but naturally, due to the design of Cursor itself (access to a set of predefined information for it to access and use), they would have it pointing to their internal policies, and rules. It would be beyond insane to just hook your email up to the Anthropic API blind and hope for the best. permalinkembedsaveparentreportreply [–]MacroMeezDev 1 point 1 day ago Confirmed this should not be happening and we are working on fixing the issue. Sorry for the hassle here. permalinkembedsaveparentreportreply [–]gabeman 5 points 1 day ago This is BS. Such an arbitrary limitation. permalinkembedsaveparentreportreply [–]BrokenToasterOven[S] 5 points 1 day ago Oh, no, you sweet summer child. They're PROTECTING you OF COURSE. 🙄 it's \"\"\"\"\"for security\"\"\"\"\" (unless you pay for another subscription 🥰🥰) revolting. permalinkembedsaveparentreportreply [–]AI-Commander 4 points 1 day ago I can understand limiting free accounts but paid accounts? I’m going to have to research alternatives and cancel my subscription if I run into this myself. Being able to make minor changes on my test machine is pretty essential to the value I receive. permalinkembedsaveparentreportreply [–]AntiTourismDeptAK 2 points 1 day ago Yep, I’m canceling as well, this is asinine. Cursor Devs, bad decision to fire this from the hip. permalinkembedsaveparentreportreply [–]BrokenToasterOven[S] 1 point 1 day ago ✊✊✊✊✊ permalinkembedsaveparentreportreply [–]abdulghanikm 1 point 1 day ago Well that's just terrible, what is an alternative/same level good IDE? I don't want an extension or not a full experience. permalinkembedsaveparentreportreply [–]BrokenToasterOven[S] 2 points 1 day ago AUGMENT CODE is absolutely cracked-out. Like, look no further. It also allows multiple machine logins. permalinkembedsaveparentreportreply [–]BrowlerPax 3 points 1 day ago Over the last days, it has gotten worse in terms of performance and implementation. It can't even understand the translation.tsx files to which language it used. I hope alternatives are getting better and cheaper. permalinkembedsavereportreply [–]BrokenToasterOven[S] 3 points 1 day ago At this point I literally cannot justify using it anymore, and I used to be the biggest evangelist of Cursor ever. I loved this, homie. Now, I feel embarassed when people bring it up because they keep doing shit like this x___x; permalinkembedsaveparentreportreply [–]BrowlerPax 1 point 1 day ago Yeah, for real, same. When Claude 3.7 sonnet is released, the first days of the 0.45 version. I can one-shot all the implementations with a single basic prompt. But now, even with my enhanced, optimized prompt in 0.45, the results are really bad; it can't even understand which file or what to do, and it ignores all the rules. 0.48 is even worse than 0.45. I think it is time to wait for the copilot or other alternatives to improve the products. permalinkembedsaveparentreportreply [–]KingAroan 3 points 1 day ago This is dumb, who cares as long as the subscription is paid??? They have throttled the slow to a ridiculous pace which I'm fine with, but I'm not fine with needing to switch from my laptop to my desktop to my work laptop depending on where I'm at when I want to write. Especially if people are on the usage based billing and are getting charged per use... permalinkembedsavereportreply [–]BrokenToasterOven[S] 1 point 1 day ago Spot on. permalinkembedsaveparentreportreply [–]medright 5 points 1 day ago So ah.. I’m logged into multiple machines w vscode insiders.. so there’s that. Boo Cursor team. Keep up the shitty ideas and you’re gonna kill your product permalinkembedsavereportreply [–]AntiTourismDeptAK 5 points 1 day ago This is ABSOLUTELY UNACCEPTABLE. I have ten machines that I run at once, and I never use slow requests. I don’t want ten different subscriptions. I’m cancelling today, that’s fucking it. Hello Roo. permalinkembedsavereportreply [–]BrokenToasterOven[S] 3 points 1 day ago R o o o. Apparently Cline, and Trae are also worth a peek! They don't lock you to one fking machine >___> permalinkembedsaveparentreportreply [–]g3_SpaceTeam 2 points 1 day ago So uh if I’m logged in to my work laptop and a remote on-prem machine I’m assuming I’m SOL? permalinkembedsavereportreply [–]Big-Reading-5255 2 points 1 day ago I feel like I’ve seen the fall of cursor coming for a while, stagnation and then we starting getting shit like this. It was only a matter of time, all great things must end at some point. permalinkembedsavereportreply [–]BrokenToasterOven[S] 1 point 1 day ago I HAD THE SAME THOUGHT! It's like watching something once great burn down. permalinkembedsaveparentreportreply [–]Agreeable-Toe-4851 2 points 1 day ago I've switched to Augment Code and have been very, very happy. It feels like it works better as an agentic coding tool and right now, it's unlimited use, which is really bonkers. I listened to the chief scientist and co-founder on the Cognitive Revolution podcast and came away very impressed. permalinkembedsavereportreply [–]BrokenToasterOven[S] 1 point 1 day ago Ooo. I might have to give it a peek :D I do like a good podcast... permalinkembedsaveparentreportreply [–]seeKAYx 2 points 1 day ago What also surprises me is that more and more users now get a system message and are forced to buy fast requests. This means that the unlimited slow requests are probably also history. Funnily enough, nobody from Cursor has commented on this yet. A Reddit post was silently deleted. But hey, it's still one of the most successful start-ups of our time! permalinkembedsavereportreply [–]mynameismati 2 points 1 day ago I use cursor on my work machine and personal MacBook, what the f guys permalinkembedsavereportreply [–]Orolol 2 points 1 day ago This is completely dumb. We're already limited in number of fast premium request per month, what's the point of restricting the number of devices ? permalinkembedsavereportreply [–]drumnation 3 points 1 day ago I pay about $300 a month in usage based pricing and have cursor on a windows machine, Linux laptop, and MacBook. So instead of just collecting more usage fees from me using my multiple computers for different things they want me to buy a $20 subscription for each? What if I don’t use $20 worth of credits on my Linux machine? Do this to free users fine, but not to paid, and for anybody paying over $100 a month to them they should absolutely not be doing anything to make the experience more of a pain in the ass. permalinkembedsavereportreply [–]BrokenToasterOven[S] 1 point 1 day ago <image> permalinkembedsaveparentreportreply [–]trgoveia 2 points 1 day ago LOL are they really implying that people share sessions to split subscriptions? The limits in the pro barely fit a single developer working full time this product is aging like fine milk day by day permalinkembedsavereportreply [–]human358 2 points 1 day ago There is no way they don't roll this back, are you fucking bonkers cursor permalinkembedsavereportreply [–]BrokenToasterOven[S] 1 point 1 day ago literally mental permalinkembedsaveparentreportreply [+]guywithalamename comment score below threshold (2 children) [+][deleted] 1 day ago (12 children) [+]Agitated_Egg_4 comment score below threshold (1 child) about blog about advertising careers help site rules Reddit help center reddiquette mod guidelines contact us apps & tools Reddit for iPhone Reddit for Android mobile website <3 reddit premium Use of this site constitutes acceptance of our User Agreement and Privacy Policy. © 2025 reddit inc. All rights reserved. REDDIT and the ALIEN Logo are registered trademarks of reddit inc. π We use cookies on our websites for a number of purposes, including analytics and performance, functionality and advertising. Learn more about Reddit's use of cookies. Please continue to new.reddit.com to set your cookie preferences. CONTINUE",
        "headline": "User Frustration Over Cursor's New Login Policy",
        "entry_sentence": "Cursor has implemented a new restriction limiting logins to a single machine for some users.",
        "detail": "Many users are unhappy, stating this change disrupts their workflow and hinders their productivity, especially those who use multiple devices.",
        "icon": "🟣"
    },
    {
        "title": "CVE program faces swift end after DHS fails to renew contract",
        "url": "https://www.csoonline.com/article/3963190/cve-program-faces-swift-end-after-dhs-fails-to-renew-contract-leaving-security-flaw-tracking-in-limbo.html",
        "content": "Topics Events Newsletter Whitepaper Home Industry CVE program faces swift end after DHS fails to renew contract, leaving security flaw tracking in limbo by Cynthia Brumfield Contributing Writer CVE program faces swift end after DHS fails to renew contract, leaving security flaw tracking in limbo News Analysis Apr 15, 2025 6 mins Government Threat and Vulnerability Management MITRE’s 25-year-old Common Vulnerabilities and Exposures (CVE) program will end April 16 after DHS did not renew its funding contract for reasons unspecified. Experts say ending the program, which served as the crux for most cybersecurity defense programs, is a tragedy. Credit: Jerome460 / Shutterstock In a stunning development that demolishes a cornerstone of cybersecurity defense, nonprofit R&D organization MITRE said that its contract with the Department of Homeland Security (DHS) to maintain the Common Vulnerabilities and Exposures (CVE) database, which organizes computer vulnerabilities, will expire at midnight on April 16. Yosry Barsoum, vice president and director of the Center for Securing the Homeland at MITRE, wrote in a missive to the CVE board, “On Wednesday, April 16, 2025, funding for MITRE to develop, operate, and modernize the Common Vulnerabilities and Exposures (CVE®) Program and related programs, such as the Common Weakness Enumeration (CWE™) Program, will expire. The government continues to make considerable efforts to support MITRE’s role in the program, and MITRE remains committed to CVE as a global resource.” End of CVE program seen as ‘tragic’ Sasha Romanosky, senior policy researcher at the Rand Corporation, branded the end to the CVE program as “tragic,” a sentiment echoed by many cybersecurity and CVE experts reached for comment. “CVE naming and assignment to software packages and versions are the foundation upon which the software vulnerability ecosystem is based,” Romanosky said. “Without it, we can’t track newly discovered vulnerabilities. We can’t score their severity or predict their exploitation. And we certainly wouldn’t be able to make the best decisions regarding patching them.” Ben Edwards, principal research scientist at Bitsight, told CSO, “My reaction is sadness and disappointment. This is a valuable resource that should absolutely be funded, and not renewing the contract is a mistake.” He added “I am hopeful any interruption is brief and that if the contract fails to be renewed, other stakeholders within the ecosystem can pick up where MITRE left off. The federated framework and openness of the system make this possible, but it’ll be a rocky road if operations do need to shift to another entity.” MITRE’s CVE program foundational to cybersecurity MITRE’s CVE program is a foundational pillar of the global cybersecurity ecosystem and is the de facto standard for identifying vulnerabilities and guiding defenders’ vulnerability management programs. It provides foundational data to vendor products across vulnerability management, cyber threat intelligence, security information, event management, and endpoint detection and response. Although the National Institute of Standards and Technology (NIST) enriches the MITRE CVE records with additional information through its National Vulnerability Database (NVD), and CISA has helped enrich MITRE’s CVE records with its “vulnrichment” program due to funding shortfalls in the NVD program, MITRE is the originator of the CVE records and serves at the primary source for identifying security flaws. “If MITRE’s funding goes away, it causes an immediate cascading effect that will impact vulnerability management on a global scale,” Brian Martin, vulnerability historian, CSO of the Security Errata project, and former CVE board member, wrote on LinkedIn. “First, the federated model and CVE Numbering Authorities (CNA) can no longer assign IDs and send info to MITRE for quick publication. Second, all of that is the foundation for the National Vulnerability Database (NVD), which is already beyond struggling, with a backlog of over 30,000 vulnerabilities and the recent announcement of over 80,000 ‘deferred’ (meaning will not be fully analyzed by their current standards).” Martin added, “Third, every company that maintains ‘their own vulnerability database’ that is essentially lipstick on the CVE pig will have to find alternate sources of intelligence. Fourth, national vulnerability databases like China’s and Russia’s, among others, will largely dry up (Russia more than China). Fourth [sic], hundreds, if not thousands, of National / Regional CERTs around the world, no longer have that source of free vulnerability intelligence. Fifth [sic], every company in the world that relied on CVE/NVD for vulnerability intelligence is going to experience swift and sharp pains to their vulnerability management program.” Why is the contract ending? It’s unclear what led to DHS’s decision to end the contract after 25 years of funding the highly regarded program. The Trump administration, primarily through Elon Musk’s Department of Government Efficiency initiative, has been slashing government spending across the board, particularly at the Cybersecurity and Infrastructure Security Agency (CISA), through which DHS funds the MITRE CVE program. Although CISA has already been through two funding cuts, press reports suggest that nearly 40% of the agency’s staff, or around 1,300 employees, are still slated for termination. However, sources say that compared to the budget cuts made elsewhere in the federal government, the expense of running the CVE program are minor and “won’t break the bank.” What happens next? Sources close to the CVE program say that starting at midnight on April 16, MITRE will no longer add records to its CVE database. However, historical CVE records will be available on GitHub. The real question is whether a private sector alternative to MITRE’s program emerges. “It’s difficult to speculate on what services could be impacted reading the note from MITRE,” Patrick Garrity, a security researcher at threat intelligence firm Vulncheck, told CSO. “The current vulnerability ecosystem is fragile after seeing NIST NVD’s failure last year, and any impacts to the CVE Program could have detrimental impacts on defenders and the security community. VulnCheck remains committed to helping fill any gaps that might arise.” Garrity posted on LinkedIn, “Given the current uncertainty surrounding which services at MITRE or within the CVE Program may be affected, VulnCheck has proactively reserved 1,000 CVEs for 2025,” adding that Vulncheck “will continue to provide CVE assignments to the community in the days and weeks ahead.” A CISA spokesperson told CSO, “CISA is the primary sponsor for the Common Vulnerabilities and Exposure (CVE) program, which is used by government and industry alike to disclose, catalog, and share information on technology vulnerabilities that can put the nation’s critical infrastructure at risk. Although CISA’s contract with the MITRE Corporation will lapse after April 16, we are urgently working to mitigate impact and to maintain CVE services on which global stakeholders rely.” Related content News New ResolverRAT malware targets healthcare and pharma orgs worldwide By Lucian Constantin Apr 15, 2025 4 mins Healthcare Industry Malware Phishing News April Patch Tuesday news: Windows zero day being exploited, ‘big vulnerability’ in 2 SAP apps By Howard Solomon Apr 8, 2025 8 mins Threat and Vulnerability Management Vulnerabilities Windows Security News Cyber agencies urge organizations to collaborate to stop fast flux DNS attacks By Howard Solomon Apr 4, 2025 4 mins Network Security Threat and Vulnerability Management Other Sections PODCASTS VIDEOS RESOURCES EVENTS SPOTLIGHT: SOLVING DATA ANALYTICS CHALLENGES SUBSCRIBE TO OUR NEWSLETTER From our editors straight to your inbox Get started by entering your email address below. Subscribe by Cynthia Brumfield Contributing Writer Cynthia Brumfield is a veteran communications and technology analyst who is currently focused on cybersecurity. She runs a cybersecurity news destination site, Metacurity.com, consults with companies through her firm DCT-Associates, and is the author of the book published by Wiley, Cybersecurity Risk Management: Mastering the Fundamentals Using the NIST Cybersecurity Framework. More from this author Show me more Popular News The most dangerous time for enterprise security? One month after an acquisition By Evan Schuman Apr 15, 2025 6 mins CSO and CISO Mergers and Acquisitions Security News analysis CVE program faces swift end after DHS fails to renew contract, leaving security flaw tracking in limbo By Cynthia Brumfield Apr 15, 2025 6 mins Government Threat and Vulnerability Management News China alleges US cyber espionage during the Asian Winter Games, names 3 NSA agents By Gyana Swain Apr 15, 2025 5 mins Cyberattacks Security About About Us Advertise Contact Us Foundry Careers Reprints Newsletters BrandPosts Policies Terms of Service Privacy Policy Cookie Policy Copyright Notice Member Preferences About AdChoices E-commerce Links Your California Privacy Rights Privacy Settings Our Network CIO Computerworld Infoworld Network World Facebook X YouTube Google News LinkedIn © 2025 IDG Communications, Inc. All Rights Reserved.",
        "headline": "CVE program faces abrupt end as funding cut",
        "entry_sentence": "The Department of Homeland Security has decided not to renew funding for the Common Vulnerabilities and Exposures (CVE) program, effective April 16.",
        "detail": "Experts warn that this decision undermines global cybersecurity efforts, leaving a significant gap in vulnerability tracking and management.",
        "icon": "🟣"
    },
    {
        "title": "Show HN: Unsure Calculator – back-of-a-napkin probabilistic calculator",
        "url": "https://filiph.github.io/unsure/",
        "content": "Unsure Calculator 7 8 9 / ⌫ 4 5 6 x ~ 1 2 3 - 0 . + = Write a formula and hit Enter, or press =. Calculate with numbers you’re not sure about Hi, I'm Filip, and I'd like to introduce to you an early version of an uncertainty calculator. Statistics are scary, but they don't need to be. If you allow me to simplify, the field of statistics is just saying: I'm not certain about these numbers, but I would still like to reason about them. Turns out we're unsure about a lot in our lives, but we can't just throw our arms in the air and say, well, I'm not a statistician. Filip’s imperfect uncertainty notation The idea is simple: apart from regular numbers (like 4, 3.14 or 43942), you can also input ranges (like 4~6, 3.1~3.2 or 40000~45000). The character between the two extremes of the range is a tilde (~), a little wave symbol. You can find it on most keyboards, but for convenience, I also included it in the keypad above. The range notation says the following to the calculator: I am not sure about the exact number here, but I am 95% sure it's somewhere in this range. That's it. I thought long and hard about this, and I got to the conclusion that simplicity is key. Yes, we could have notations for different probability distributions, for different confidence levels, for truncations, for covariance, and so on. But that would also make it harder to understand. My assumption is that, if you're already cozy enough with things like confidence levels, you'll want to use something more sophisticated anyway. Here, we're interested in unlocking the power of statistics to a broad audience. Reading the notation is easy: when you see 10~15, you say: \"ten to fifteen\". Statistics for the rest of us People short-circuit when they encounter uncertainty. \"Well, this is not certain, but that other thing also isn't, so it doesn't matter.\" It often does! \"Well, I don't know this number exactly, so I'll just pick the first number that seems plausible and calculate with that.\" Please don't! Our brains like the simplicity of single numbers, simple answers, but it's a trap. See below. A practical example This example is inspired by a true story. It is the year 2015 and our family has a dilemma. I get a chance to apply for a job in a different part of the world. My wife and I agree it would be pretty sweet to try living somewhere else for a few years, and we welcome the learning opportunity. On the other hand, we also have a new mortgage for our small flat in the city, and a one year old baby. I would like to at least know if it's a good move, financially. Will we be losing money? If so, how quickly? The problem is, nothing is certain. The company won't tell us the salary until after we go through most of the steps. I ask friends and random people on the internet about the cost of living in the area, but I get wildly different numbers. Even the tax rate isn't a simple percentage, but \"depends\". At first, I go with a simple spreadsheet calculation. I pick a reasonably conservative number for each variable and do the math. $1,500 salary, 40% tax rate, $650 rent, $150 food, $30 baby stuff, $20 transportation. 1500 * 0.6 - 650 - 150 - 30 - 20 = 50 It looks like we'll be making +$50 each month, assuming we don't spend on anything extra. On one hand, that's cool: we're not considering the move to get rich. On the other hand, it's a little scary. What if I wasn't conservative enough with some of the numbers, and we realize too late that we're bankrupting our family? I mean, it's good to know that one potential result is +$50 per month. But what about the other possible results? There's a piece of monologue in a Czech theatrical comedy that I'm quite fond of, and it goes something like this: “According to our carbon dating analysis, this letter was written on January 21, 1842, plus-minus two thousand years.” Unsure Calculator to the rescue! It seems we have quite a few values in our little formula that are actually ranges. I'm not sure about the exact value, but I am pretty sure about the general range into which each value will fall. Let's redo the calculation with ranges: 1400~1700 * 0.55~0.65 - 600~700 - 100~200 - 30 - 20 = -60~220 Now, I am 95% sure the real value of each item falls into the range. That means I am also 95% sure the real balance will fall into the -$60 to +$220 range. This is much more helpful than the one number before. For one thing, I now know that we could very well be losing money. I also have the probability distribution and the percentiles. The percentiles tell me that there's a 10% chance that our monthly balance will be -$8 or worse. (Because I see -$8 as the 10th percentile, which means that 10% of the outcomes will be lower than -$8. Conversely, 90% of the outcomes will be higher than -$8.) Now, our family can make a better informed decision. Are we willing to risk the 10% chance that we'll be losing money by this move? What about the 5% risk that we'll be losing $33 or more per month? The answer to that will depend on the family and the situation. Without a kid and a mortgage, I was way more likely to take risks than I am today. On the other hand, if we didn't have backup plans, I'd be a lot more wary of the 10% chance. In the end, we did it. And, in our case, it happened to pay back. The end. A sci-fi example This tool is meant for practical, everyday calculations. One example of such a use is in the previous section. But I can't pass by the opportunity to make an example that involves … aliens. There is a famous formula in astrophysics called the Drake equation. It is an estimate of the number of civilizations in our galaxy with which communication might be possible. For example, if we listen to radio signals from the stars, should we expect hundreds of civilizations trying to reach each other in our galaxy? Or is it more like thousands? Or zero? Is it realistic to expect we're alone here? The Drake equation is actually very simple: it's just a multiplication of 7 numbers: The original formula (written in 1961 by one Frank Drake) and its values went like this: in our galaxy, there is one star formed per year (R*), of which one fifth (fp) have about 3 planets (ne), of which 100% (fl) will eventually develop life, of which 100% (fi) will eventually become intelligent, of which 10% (fc) will be able to communicate, and will last 1 million years (L). If you put all these numbers together, you'll get to the number 60,000. There should be 60 thousand civilization at any one time, trying to communicate with each other across the galaxy. Where are they? As you might expect, there's been a lot of discussion about this equation since 1961. The estimated values for each of the parameters vary wildly between astrophysicists. So, let's get the latest estimates, and put them into ranges. This gives us the following: 1.5~3 x 0.9~1.0 x 0.1~0.4 x 0.1~1.0 x 0.1~1.0 x 0.1~0.2 x 304~10000 If we put it into the Unsure Calculator, we get this: So, we can expect anywhere between 0 and 450 civilizations. And the probability skews to the lower end (the histogram is wider towards the bottom). Note: If you're curious why there is a negative number (-5) in the histogram, that's just an inevitable downside of the simplicity of the Unsure Calculator. Without further knowledge, the calculator cannot know that a negative number is impossible (in other words, you can't have -5 civilizations, for example). Other use cases Here are some ideas of how to use this calculator and its notation. Estimate viability of a business idea, with uncertain size of the market, uncertain market share, uncertain monthly sales per person, and uncertain operational costs. For example: 50000~80000 x 0.10~0.20 x 5~10 - 20000~50000 Estimate future income with uncertain money per month, length of a gig, and tax rate. For example: 1000~1500 x 10~12 x (30~50 / 100) Estimate time saved by a dishwasher (or any other piece of technology) given uncertain number of times used per week, uncertain time saving per use, uncertain lifetime and uncertain installation costs. For example: (3~5 * 5~10 * 51 * 7~15) / 60 - 10~15 Estimate total return of an investment account. Both the interest rate and length of investing is unsure. For example: 5000 x (-2~5 / 100) x 5~10 Estimate the probability of dying in a pandemic, given an uncertain morbidity rate (how many people get sick) and mortality rate (how many infected people die). For example: (10~30 / 100) * (0.1~1.0 / 100) * 100 Estimate the height of a skyscraper, given an uncertain distance from its base, and an uncertain angle in which we see the top of it. For example: 100 x tan(70 ~ 80) Estimate return on investment of a marketing campaign, given an uncertain number of views, uncertain click through rate, uncertain conversion rate, and uncertain spend. For example: 1000000 x (2~3 / 100) x (3~5 / 100) x (10~15) Available functions In the keypad above, you will only find +, -, x and /. But the calculator supports more than that, even in this early stage. You can calculate 2~3 ^ 4 (two to three, to the power of four), sqrt(10~12) (square root of ten to twelve) or sin(90~95) (sine of ninety to ninety five degrees). Limitations This is a one man show. You should expect breakages. The formula parser is brittle and gives unhelpful error messages. The computation is quite slow. In order to stay as flexible as possible, I'm using the Monte Carlo method. Which means the calculator is running about 250K AST-based computations for every calculation you put forth. The UI is ugly, to say the least. The only way to share formulas is to manually construct a URL. For example, sending someone to https://filiph.github.io/unsure/#f=20~30 will auto-compute 20~30 for them. Range is always a normal distribution, with the lower number being two standard deviations below the mean, and the upper number two standard deviations above. Nothing fancier is possible, in terms of input probability distributions. And of course, this is not a statistician's tool. Use the Unsure Calculator for back-of-a-napkin calculations. For anything more involved, use one of the free or paid statistical tools, a full programming environment, or hire a statistician. I hope some people will find this tool useful, despite the limitations and despite its spartan design. — Filip Hracek, March 2020 P.S.: If you want to help improve this tool, or if you want to get the command-line version, go to github.com/filiph/unsure. P.P.S. (update 2025): I've been using this notation and tool for the past 5 years, and it's now an indispensable part of my workflow when starting any new project. A more recent \"notebook\" version of the app can be found here — that one is less beginner-friendly, but more helpful for \"power users\" (N=1). If you're interested in this project, you can follow me or subscribe to my mailing list (check \"software development\" as the topic you're interested in).",
        "headline": "Introduction of the Unsure Calculator",
        "entry_sentence": "Filip has launched an early version of the Unsure Calculator to help users manage uncertainty in calculations.",
        "detail": "The tool allows users to input ranges of values, simplifying statistical reasoning and providing a clearer understanding of potential outcomes.",
        "icon": "🟣"
    }
]