[
    {
        "title": "Electron band structure in germanium, my ass (2001)",
        "url": "https://pages.cs.wisc.edu/~kovar/hall.html",
        "content": "Electron Band Structure In Germanium, My Ass Abstract: The exponential dependence of resistivity on temperature in germanium is found to be a great big lie. My careful theoretical modeling and painstaking experimentation reveal 1) that my equipment is crap, as are all the available texts on the subject and 2) that this whole exercise was a complete waste of my time. Introduction Electrons in germanium are confined to well-defined energy bands that are separated by \"forbidden regions\" of zero charge-carrier density. You can read about it yourself if you want to, although I don't recommend it. You'll have to wade through an obtuse, convoluted discussion about considering an arbitrary number of non-coupled harmonic-oscillator potentials and taking limits and so on. The upshot is that if you heat up a sample of germanium, electrons will jump from a non-conductive energy band to a conductive one, thereby creating a measurable change in resistivity. This relation between temperature and resistivity can be shown to be exponential in certain temperature regimes by waving your hands and chanting \"to first order\". Experiment procedure I sifted through the box of germanium crystals and chose the one that appeared to be the least cracked. Then I soldered wires onto the crystal in the spots shown in figure 2b of Lab Handout 32. Do you have any idea how hard it is to solder wires to germanium? I'll tell you: real goddamn hard. The solder simply won't stick, and you can forget about getting any of the grad students in the solid state labs to help you out. Once the wires were in place, I attached them as appropriate to the second-rate equipment I scavenged from the back of the lab, none of which worked properly. I soon wised up and swiped replacements from the well-stocked research labs. This is how they treat undergrads around here: they give you broken tools and then don't understand why you don't get any results. Fig. 1: Check this shit out. In order to control the temperature of the germanium, I attached the crystal to a copper rod, the upper end of which was attached to a heating coil and the lower end of which was dipped in a thermos of liquid nitrogen. Midway through the project, the thermos began leaking. That's right: I pay a cool ten grand a quarter to come here, and yet they can't spare the five bucks to ensure that I have a working thermos. Results Check this shit out (Fig. 1). That's bonafide, 100%-real data, my friends. I took it myself over the course of two weeks. And this was not a leisurely two weeks, either; I busted my ass day and night in order to provide you with nothing but the best data possible. Now, let's look a bit more closely at this data, remembering that it is absolutely first-rate. Do you see the exponential dependence? I sure don't. I see a bunch of crap. Christ, this was such a waste of my time. Banking on my hopes that whoever grades this will just look at the pictures, I drew an exponential through my noise. I believe the apparent legitimacy is enhanced by the fact that I used a complicated computer program to make the fit. I understand this is the same process by which the top quark was discovered. Conclusion Going into physics was the biggest mistake of my life. I should've declared CS. I still wouldn't have any women, but at least I'd be rolling in cash.",
        "headline": "Student Research Reveals Flaws in Germanium Experiments",
        "entry_sentence": "A recent study on the resistivity of germanium has uncovered serious issues with the experiment's validity.",
        "detail": "The researcher claims that their findings contradict the expected exponential dependence of resistivity on temperature, leading to frustrations about inadequate equipment and support during the study.",
        "icon": "⚛️"
    },
    {
        "title": "Bletchley code breaker Betty Webb dies aged 101",
        "url": "https://www.bbc.com/news/articles/c78jd30ywv8o",
        "content": "Skip to content Register Sign In Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Bletchley code breaker Betty Webb dies aged 101 22 hours ago Share Save Aida Fofana BBC News, West Midlands BBC Bletchley Park code breaker Betty Webb has died at the age of 101 A decorated World War Two code breaker who spent her youth deciphering enemy messages at Bletchley Park has died at the age of 101. Charlotte \"Betty\" Webb MBE - who was among the last surviving Bletchley code breakers - died on Monday night, the Women's Royal Army Corps Association confirmed. Mrs Webb, from Wythall in Worcestershire, joined operations at the Buckinghamshire base at the age of 18, later going on to help with Japanese codes at The Pentagon in the US. She was awarded France's highest honour - the Légion d'Honneur - in 2021. The Women's Royal Army Corps Association described Mrs Webb as a woman who \"inspired women in the Army for decades\". Bletchley Park Trust CEO Iain Standen said Mrs Webb will not only be remembered for her work but \"also for her efforts to ensure that the story of what she and her colleagues achieved is not forgotten.\" \"Betty's passion for preserving the history and legacy of Bletchley Park has undoubtedly inspired many people to engage with the story and visit the site,\" he said in a statement. Tributes to Mrs Webb have begun to be posted on social media, including one from historian and author Dr Tessa Dunlop who said she was with her in her final hours. Describing Mrs Webb as \"the very best\", she said on X: \"She is one of the most remarkable woman I have ever known.\" Listen on BBC Sounds: Mrs Webb went to work at Bletchley Park when she was 18 Mrs Webb told the BBC in 2020 that she had \"never heard of Bletchley\", Britain's wartime code-breaking centre, before starting work there as a member of the ATS, the Auxiliary Territorial Service. She had been studying at a college near Shrewsbury, Shropshire, when she volunteered as she said she and others on the course felt they \"ought to be serving our country rather than just making sausage rolls\". Her mother had taught her to speak German as a child and ahead of her posting remembered being \"taken into the mansion [at Bletchley] to read the Official Secrets Act\". \"I realised that from then on there was no way that I was going to be able to tell even my parents where I was and what I was doing until 1975 [when restrictions were lifted],\" she recalled. She would tell the family with whom she lodged that she was a secretary. Bletchley Park veteran celebrates 100th birthday Codebreaker Betty Webb reveals D-Day confidence Ex-Bletchley Park worker, 98, given French honour When WW2 ended in Europe in May 1945, she went to work at the Pentagon after spending four years at Bletchley, which with its analysis of German communications had served as a vital cog in the Allies' war machine. At the Pentagon she would paraphrase and transcribe already-decoded Japanese messages. She said she was the only member of the ATS to be sent to Washington, describing it as a \"tremendous honour\". Mrs Webb, in 2020, recalled she had had no idea the Americans planned to end the conflict by dropping atomic weapon on Japanese cities, describing the weapons' power as \"utterly awful\". After the Allies' final victory, it took Mrs Webb several months to organise return passage to the UK, where she worked as a secretary at a school in Shropshire. The head teacher there had also worked at Bletchley so knew of her professionalism, whereas other would-be employers, she recalled, were left stumped by her being unable to explain - due to secrecy requirements - her previous duties. More than half a century later, in 2021, Mrs Webb was one of 6,000 British citizens to receive the Légion d'Honneur, following a decision by President François Hollande in 2014 to recognise British veterans who helped liberate France. PA Media Betty Webb, seen in the front row in a red suit, was invited to the Coronation In 2023, she and her niece were among 2,200 people from 203 countries invited to Westminster Abbey to see King Charles III's coronation. The same year she celebrated her 100th birthday at Bletchley Park with a party. She and her guests were treated to a fly-past by a Lancaster bomber. She said at the time: \"It was for me - it's unbelievable isn't it? Little me.\" Related internet links Women’s Royal Army Corps Association Bletchley Park Bletchley Park Wythall RELATED Bletchley Park veteran celebrates 100th birthday 1 day ago England Exhibition explores World War Two origins of AI 31 Jan 2025 Beds, Herts & Bucks 'Our dad helped to build the Colossus computer' 9 Nov 2024 Beds, Herts & Bucks MORE 1 day ago Driverless shuttle bus on show at transport museum The shuttle bus carries 10 passengers and uses lasers, scanners, cameras, sensors and software to get around. England 8 Mar 2025 Model King James train to be auctioned for charity Dennis Herbert took nine years to build the model steam train. England 30 Jan 2025 Is Birmingham to blame for Bromsgrove crime? An MP blames criminals crossing county lines for a wave of \"crime and lawlessness\". Birmingham & Black Country 18 Nov 2024 Couple reunited with dogs taken in vehicle theft Tina Kazmi feared the worst when her five dogs and partner's bronze Land Rover were stolen. Birmingham & Black Country 3 Nov 2024 Flood prevention measures to get under way A series of dams and a water storage pool will be created in Wythall after serious flooding in 2018. Hereford & Worcester Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather BBC Shop BritBox BBC in other languages Follow BBC on: Terms of Use About the BBC Privacy Policy Cookies Accessibility Help Contact the BBC Advertise with us Do not share or sell my info Contact technical support Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking. Let us know you agree to cookies We use cookies to give you the best online experience. Please let us know if you agree to all of these cookies. Yes, I agree No, take me to settings",
        "headline": "Bletchley Park code breaker Betty Webb dies at 101",
        "entry_sentence": "Betty Webb, a renowned World War Two code breaker, has passed away at the age of 101.",
        "detail": "She was among the last surviving members of the Bletchley code breakers and was celebrated for her contributions to the Allies during the war, including her work on Japanese codes at The Pentagon.",
        "icon": "🕵️‍♀️"
    },
    {
        "title": "Glubux's Powerwall (2016)",
        "url": "https://secondlifestorage.com/index.php?threads/glubuxs-powerwall.126/",
        "content": "Home Forums What's new Battery Tools Discord Facebook Group Log in Register Search New posts Search forums Home Forums Solar, Wind, and Battery Systems DIY Battery Project Builds Glubux's Powerwall Thread starter Glubux Start date Nov 9, 2016 ALL NEW - Battery Finder Search for 12/24/36/48v or by capacity www.batteryfinder.net New & used Batteries, Solar, accessories, LifePo4 cells & more 5% Coupon \"Powerwalls\" www.batteryhookup.com 1 2 3 … 15 Next Glubux Member Joined Nov 9, 2016 Messages 124 Nov 9, 2016 #1 A quick presentation of my project. I already produce a part of the electricity that I need. I have 1.4 kw of solar panel on the roof, an old 24v 460AH forklift battery, a Victron MPPT 100/50 charge controler, an 24v to 12v Victron voltage lowerer, and a 3KVA Victron inverter. The plan is to build a shed to put all the batteries and the charge controler/inverters. I started to collect laptop batteries a few months ago, I have around 650 for now, I started sorting and making my packs: Ideas are : -100 Ah for each pack by matching the number of cells, possibilty to add or remove cells if needed -maximum use of copper wire, easy to find and easy to solder -same bus bar lenght for each cell Reactions: tytower, jamesk9, JustMeTMC and 5 others Glubux Member Joined Nov 9, 2016 Messages 124 Nov 9, 2016 #2 This is how I test my cells for now : Sean Member Joined Oct 8, 2016 Messages 936 Nov 9, 2016 #3 Your neatness is to be applauded. Have you tried testing the same cell in each of your dischargers and comparing the results ? Glubux Member Joined Nov 9, 2016 Messages 124 Nov 9, 2016 #4 Sean said: Your neatness is to be applauded. Have you tried testing the same cell in each of your dischargers and comparing the results ? Thank you. I tested it indirectly by testing a freshly separated pair of cells and capacity was only a few mah different, this happened a couple of time on different chargers so I would say they are not perfect but precise enough. Glubux Member Joined Nov 9, 2016 Messages 124 Nov 9, 2016 #5 Glubux said: Sean said: Your neatness is to be applauded. Have you tried testing the same cell in each of your dischargers and comparing the results ? Click to expand... Thank you. I tested it indirectly by testing a freshly separated pair of cells and capacity was only a few mah different, this happened a couple of time on different chargers so I would say they are not perfect but precise enough. Click to expand... Reactions: Sparky28 M miwall New member Joined Oct 26, 2016 Messages 18 Nov 10, 2016 #6 Hi like you Idea of using copper wire for busbars what Size cable is this looks like it could be 1.5mm or 2.5mm cable striped from Twin and Earth cable used for house wiring ? Also what with missing out Batteries in your pack! L Lux_Gamer Member Joined Oct 11, 2016 Messages 63 Nov 10, 2016 #7 Hello, I really like your pack design and your fuses. One question is all that copper not a bit over kill. Correct me if i am wrong but if it is 2,5mm cable it could handle 16-25 amps. On the other hand i dont know how much you will pull form that pack. Lux, Glubux Member Joined Nov 9, 2016 Messages 124 Nov 10, 2016 #8 The copper wire is a 1,5 mm, easy to find, I'm not sure it's overkill, I ll see when I'll put them to the test, anyway it is better to have too thick than too thin. S station240 Member Joined Oct 9, 2016 Messages 177 Nov 10, 2016 #9 That size wire is probably about right, as you also have to consider resistance. I worked out what the resistance of the longest length of wire there is. 0.0022789 Ohm => 2.2789mOhm So the internal resistance of a cell is higher than the resistance of the wire. PaulKennett Member Joined Oct 9, 2016 Messages 86 Nov 13, 2016 #10 Very tidy pack there. And great colour spread too. Good job. -- Paul Kennett https://www.youtube.com/user/paulkennett http://www.myonlinediary.com/index.php/Energy/PowerWall https://teespring.com/stores/18650-merch- 18650 t-shirts Glubux Member Joined Nov 9, 2016 Messages 124 Nov 20, 2016 #11 Thank you Paul Update, 6 packs are ready now, the 7th will be ok very soon. Reactions: mike1979 M miwall New member Joined Oct 26, 2016 Messages 18 Nov 20, 2016 #12 Hi Looking good i like you idea of using copper wire for he busbars i have copied you design within slight modification will up load pic soon, also how are you capacity rated your packs i see some of the have cells missing??? good work keep it up....! :mrgreen: Reactions: Sdsparrow Glubux Member Joined Nov 9, 2016 Messages 124 Nov 20, 2016 #13 I decided to make 100Ah packs with a maximum size of 80 cells, the lowest cells I used are between 1200 and 1300 mah ( 1250 X 80 = 100) I'm building 7 packs, running some test and if everything is ok I'll build bigger packs this time, 160 cells, minimum 1500mah, 250 Ah Looking forward to your build! hbpowerwall Administrator Joined Oct 7, 2016 Messages 2,249 Nov 21, 2016 #14 Love the effort into making them look smart. Don't look anything like used laptop parts any more good work. Use coupon code ' POWERWALLS' for up to 10% off! Battery Hookup USA https://bit.ly/BatteryHookUP BigBattery USA - https://bit.ly/Bigbattery Reactions: Chris Evans M miwall New member Joined Oct 26, 2016 Messages 18 Nov 23, 2016 #15 HI looking good how do you intend to mount it to the board / wall ?? Glubux Member Joined Nov 9, 2016 Messages 124 Nov 23, 2016 #16 I think they will be on a shelf at first, in a garden shed, with one shelf per string but this is not completely clear in my mind, I ll post some pictures later. L Lux_Gamer Member Joined Oct 11, 2016 Messages 63 Nov 25, 2016 #17 Hi Glubux Nice pictures they look very good. Which camera are you using? Really looking forward to new updates Lux, Glubux Member Joined Nov 9, 2016 Messages 124 Nov 25, 2016 #18 Thanks. I'm using a Nikon D7200 with a 17-55 F2.8 and a 85mm F1.8, great lenses! Glubux Member Joined Nov 9, 2016 Messages 124 Nov 25, 2016 #19 Just a teaser for tomorrow, the packs are ready to plug, I hope it will be a sunny day! Reactions: mikesdiypowerwall and Solexx X Glubux Member Joined Nov 9, 2016 Messages 124 Dec 3, 2016 #20 A little update here after one week of lithium power! First thing, I really like how the cells react compared to lead acid, the charge efficiency seems a lot better, no waste in absorption. They hold the load very well too, the voltage goes down very slowly and predictably. I didn't try big loads yet, the biggest was the hoover, a bit above 1200W and absolutely no sign of warming, I'll try to drain more power in a few days and watch with the thermal camera, but first I need some sun to charge. I had an issue though, I let everything plugged during the night to see how well it hold the charge (2 fridges, the inverter, the 18650 process...). During the 5 first nights all was ok, there was remaining around 20% energy in the morning, but in the 6th night the voltage dropped dramatically, 4 packs were still at 3.30v, the next one was 3v, the next one slightly above 2v and the last one slightly bellow 2v... That's the goal of testing I guess, so I unplugged every packs, recharged to 3 volts the lowest and then went to work thinking about what happened. And the interesting learning that comes out of this is than the biggest voltage drop was in the pack with the less cells. Just a reminder, I decided to make 100 Ah packs by matching the number of cells, 80x 1250 cells for the full pack and 51x 1950 for the more empty. I knew this wasn't going to be perfectly accurate and now I can see clearer. Those simple math are done with the capacity mesured with a 1C discharge rate, but we now that if you discharge at a lower C rating, the capacity raises, my guess is than it raises more on a 80 cell pack than on a 51. So I add a few cells in the packs (very easy to do BTW), re-balanced them and I'm looking forward to see how it goes. One last thing about balancing, the first time I blanced them (at 3.8v), I noticed than they were drifting a bit while reaching full charge (4v) and same thing with low voltage (3.3v) but everytime they were around 3.8v, the balance was still perfect. Two conclusion : first, this was a clue that some packs were a bit weaker, the ones I noticed then were the ones which fell around 2v. Second thing, I think as long as you don't reach the top or the bottom of your packs, they can be slightly uneven without unbalancing. Reactions: Wattsup, thanar, nikita and 1 other person 1 2 3 … 15 Next You must log in or register to reply here. Share: Facebook Twitter Reddit Pinterest Tumblr WhatsApp Email Link Home Forums Solar, Wind, and Battery Systems DIY Battery Project Builds Terms and rules Privacy policy Help Home RSS Community platform by XenForo® © 2010-2023 XenForo Ltd. This site uses cookies to help personalise content, tailor your experience and to keep you logged in if you register. By continuing to use this site, you are consenting to our use of cookies. Accept Learn more…",
        "headline": "DIY Battery Project Update",
        "entry_sentence": "Glubux has provided an update on his renewable energy project that includes solar panels and battery packs.",
        "detail": "He successfully built several battery packs and is testing their performance with various loads, noting improvements in efficiency compared to lead-acid batteries.",
        "icon": "☀️"
    }
]