[
    {
        "title": "The demoscene as a UNESCO heritage in Sweden",
        "url": "https://www.goto80.com/the-demoscene-as-a-unesco-heritage-in-sweden",
        "content": "Music Performance Art Research Archive Random Contact The demoscene as a UNESCO heritage in Sweden Mar 31, 2025 | ramblings The demoscene has become a national UNESCO-heritage in Sweden, thanks to an application that Ziphoid and me did last year. This has already happened in several European countries, as part of the international Art of Coding initiative to make the demoscene a global UNESCO heritage. I think this makes plenty of sense, since the demoscene is arguably the oldest creative digital subculture around. It has largely stuck to its own values and traditions throughout the world’s technological and economical shifts, and that sort of consistency is quite unusual in the digital world. The main idea of the demoscene is to compete with productions that maximize a certain hardware, but that’s not what all demosceners like to do. My demogroup Hack n’ Trade for example, cares more about making weird stuff, and there are plenty of other groups like that. Some demosceners don’t release anything at all, but might do important work to keep the scene alive (BBS-trading, organizing parties, preserving software…). I’ve written plenty of papers and blog posts about the demoscene, and I’ve often felt a gap between the stuff I write as a researcher and my personal experience of the demoscene. There is certainly an international demoscene with big events and huge releases that can be described in general terms, but what has mattered more to me is the local scenes, the small parties and the people you hang out with. Meeting up with a bunch of friends and making weird computer stuff “for no reason, really” is a great setting. That’s what I enjoy the most, in the end. For other sceners, it’s different. There is a sort of diversity in the scene that is difficult to capture and generalize. The Swedish coder with a well-paid programming job and a busy family life might consider the demoscene as an escape to his teenage years, while the LSD-munching raver from France who trades illegal warez on BBSs and makes weird pixel art considers the scene as a free culture without corporate or art world bullshit. There’s room for both in the scene, because it is werdly conservative and open at the same time. And perhaps that is one of the reasons why it should be considered an intangible heritage.",
        "headline": "Demoscene Recognized as UNESCO Heritage in Sweden",
        "entry_sentence": "Sweden has officially recognized the demoscene as a national UNESCO-heritage following an application submitted last year.",
        "detail": "This recognition is part of the international Art of Coding initiative, aiming to elevate the demoscene to global UNESCO heritage status, celebrating its unique consistency and creativity in the digital world.",
        "icon": "🎨"
    },
    {
        "title": "The Guardian flourishes without a paywall",
        "url": "https://nymag.com/intelligencer/article/how-the-guardian-us-flourishes-without-a-paywall.html",
        "content": "INTELLIGENCER THE CUT VULTURE THE STRATEGIST CURBED GRUB STREET MAGAZINE Subscribe Sign In Menu Search Menu STOP THE PRESSES The Newspaper Flourishing Without a Paywall 11 COMMENTS Search STOP THE PRESSES The Newspaper Flourishing Without a Paywall By Charlotte Klein, a features writer and media columnist at New York Magazine MAR. 27, 2025 SAVE Save this article to read it later. 11 COMMENTS Photo-Illustration: Intelligencer; Photos: Getty Images There was a time in media when having a billionaire owner was an asset. For many outlets, this is still the case, particularly those publishing super-secretive group chats of powerful government officials who seem eager to trample on the rights of the press. But for others, like the Washington Post and the Los Angeles Times, both of which have seen their benefactors bend a knee to Donald Trump and sacrifice the integrity of their newspapers in the process, ownership has become a problem. A problem that the Guardian US, the American arm of the British newspaper, has exploited. “All around us, media organizations have begun to capitulate,” editor Betsy Reed writes in the current fundraising appeal at the bottom of each Guardian article. “The Guardian has neither a self-interested billionaire owner nor profit-seeking corporate henchmen pressuring us to appease the rich and powerful. With the new administration boasting about its desire to punish journalists, and Trump and his allies already pursuing lawsuits against newspapers whose stories they don’t like, it has never been more urgent, or more perilous, to pursue fair, accurate reporting. Can you support The Guardian today?” The asks themselves are not new. The Guardian for the past eight years has asked readers to donate in support of its journalism, a “reader revenue” program that helps the paper exist without a paywall. But the appeals have gotten more strident — and more Trump-focused — since the Post and the L.A. Times withdrew expected endorsements for Kamala Harris last fall, and to great effect. The last week in February was the second-biggest week in U.S. reader-revenue history for The Guardian; the biggest was the week of the 2024 presidential election. The Guardian US expects to hit $44 million in voluntary reader donations in the U.S. and Canada this year, up 33 percent over last year, with some people supporting on a recurring basis and others giving one-time contributions. A first-person account by a Canadian citizen detained by ICE, for example, netted $105,000 in pledged donations. These contributions account for more than 60 percent of the American operation’s total revenue, which last year exceeded costs by $16 million (the rest of its revenue comes from advertising and philanthropic support from foundations). The amount that people are contributing on a pledged basis doubled in October — the month that Jeff Bezos pulled the Post’s endorsement for Harris — and has stayed at that level every month since, according to internal data provided by The Guardian, which just surpassed 350,000 recurring supporters in the U.S. “Our messaging does appeal to people to support our work as a kind of cause, and I think that works for a number of reasons,” Reed said in a recent interview in her downtown office, “but one is that there is a real crisis of access to reliable information for people who don’t want or have the means to subscribe to the New York Times. That is a real problem that we have an answer to.” Guardian managing director Steve Sachs added that The Guardian’s global perspective — the internal catchphrase of the U.S. operation is that it covers America for the world and the world for America — is also a draw at such a volatile moment in geopolitics. “People are even more interested now than they were six months ago,” he said. The Guardian US’ audience is split 50-50 between American and global readers. The Guardian launched its U.S. operation more than a decade ago and seemed to have a promising start, hiring high-profile columnists like Michael Wolff and Glenn Greenwald and winning a Pulitzer for reporting on widespread secret surveillance by the National Security Agency. But as the Obama era gave way to the Trump era, the close association of the Guardian US with surveillance-state reporting made it less relevant to American readers. Annual losses led to restructuring that hit the U.S. operation, once housed in an airy Soho loft, particularly hard. But during the pandemic, the Guardian US, like other news outlets, experienced a surge in reader interest, readying it for an expansion in 2022 that included hiring Reed, formerly of The Nation and the Intercept, and Sachs, who’d spent years on the business side of Time Inc. The audience has continued to grow, with Sachs noting that the site typically sees between 40 million to 50 million unique visitors a month. “We’re now at a place where our audience is actually bigger in the U.S. than The Wall Street Journal’s audience in the U.S.,” he said. Leaders and organizations across the media industry have been trying to innovate in the way people can pay for news. Sachs says he’s been increasingly asked about the no-paywall model, with others in the industry wondering whether they should adopt the same. “If you’re creative enough, you can figure out some new things,” he tells people. “But the question is, does it scale?” If it’s “another half-million dollars, a million dollars, whatever, it’s not worth the effort,” he said. Other publications that were donations-focused, including Vox.com (which is owned by the same parent company as New York), have moved away to membership models as a result. “The reason I think that it works for us is we cover so much breaking news and it drives a lot of traffic, and we have the scale to make it work,” Reed said. “Even if we only monetize one percent, it’s still a lot.” Still, even scaled-up publications like the Guardian US have to contend with the fact that donations are very boom-and-bust. Despite The Guardian’s strident anti-Trump fundraising pushes, its broader audience is less partisan, as is the tone of its news coverage. It’s a weird line to straddle. “The appeals that you see at the bottom of articles are really framed around issues of press freedom and our identity and our structure of ownership,” Reed said. “They are not appeals that say, ‘Trump is bad, you need to support The Guardian, we are against Trump.’” Maybe not explicitly. But they are clearly benefitting from this moment and using the new money to hire, with expectations to continue growing its staff in the U.S. this year. The big question is: Will it last? “I mean, unfortunately, there’s no shortage of global crises going on, from what’s happening in the Middle East to Ukraine to what’s happening in this country,” Reed said. “The world is incredibly interested in the shitshow here. God, it’s like they’re rubbernecking at a car crash.” SIGN UP FOR THE INTELLIGENCER NEWSLETTER Daily news about the politics, business, and technology shaping our world. Email MORE FROM THIS SERIES The New Substack Universe MSNBC’s Post–Joy Reid, Post-NBC Future Is Kind of Bright? How Trump Is Dividing and Conquering the White House Press Corps SEE ALL TAGS: STOP THE PRESSES MEDIA THE GUARDIAN SHOW 11 COMMENTS FEATURED VIDEO FROM INTELLIGENCER Elon Musk's Daughter Calls Him \"Cringe\" in New Interview MOST VIEWED STORIES Meghan Markle’s Latest Big Idea: Rinsing and Reusing Jam Jars Where’s Forrest Fenn’s Treasure Now? The Age of Don Jr. If Trump Gets a 3rd Term, Democracy Will Have Already Ended The Newspaper Flourishing Without a Paywall EDITOR’S PICKS MEN The White Lotus, the Manosphere, and a World Without Women POLITICS The Most Important Judge in America RELATIONSHIPS What Would You Do If Your Husband Spent $46,000 on OnlyFans? 8:30 A.M. GAMES Are the Yankees Cheating or Just Good? By WILL LEITCH A quick guide to the “torpedo-bat” faux scandal sweeping baseball. 6:00 A.M. MEN The White Lotus, the Manosphere, and a World Without Women By RYU SPAETH The show suggests the contemporary heterosexual male has arrived at some pretty interesting existential places. 5:00 A.M. POLITICS The Most Important Judge in America By CRISTIAN FARIAS James Boasberg isn’t a “radical left lunatic,” and that makes him all the more challenging for Trump. MOST POPULAR Meghan Markle’s Latest Big Idea: Rinsing and Reusing Jam Jars By MARGARET HARTMANN Where’s Forrest Fenn’s Treasure Now? By BENJAMIN WALLACE The Age of Don Jr. By NINA BURLEIGH Tim Walz: Why We Lost By DANIEL STRAUSS If Trump Gets a 3rd Term, Democracy Will Have Already Ended By ED KILGORE 3/31/2025 WHAT WE KNOW Economic Warnings About Trump’s Tariffs Are Piling Up By CHAS DANNER AND NIA PRATER Trump says his new tariffs will be “Liberation Day” for America. Economists’ and market analysts’ views are far more ominous. 3/31/2025 EARLY AND OFTEN Stagflation Would Blow Up Trump’s Second Term Like Nothing Else By ED KILGORE The record is pretty clear: Stagflation is a political killer, particularly for a president whose election victory depended so heavily on the economy. 3/31/2025 ROYAL RUMBLINGS Meghan Markle’s Latest Big Idea: Rinsing and Reusing Jam Jars By MARGARET HARTMANN The most recent As ever email was light on actual product news, but it did contain groundbreaking recycling tips. 3/31/2025 EARLY AND OFTEN Will Trump Fire Mike Waltz Over the Leaked Signal Group Chat? By MARGARET HARTMANN Despite calls for Mike Waltz or Pete Hegseth to resign, so far White House officials are bashing only The Atlantic. Here’s the latest on the debacle. 3/31/2025 EARLY AND OFTEN 2025 Elections Begin With Big Throwdown in Wisconsin By ED KILGORE Musk is all but on the ballot in Wisconsin, kicking off a year of special and scheduled elections for Congress, governorships, and many city halls. 3/31/2025 EARLY AND OFTEN What Democrats Can Learn From Bernie’s Cathartic Rallies By ROSS BARKAN He may not be the future of the party, but his lucid messaging style should be. 3/31/2025 CRYPTO The New Trump Get-Richer-Quicker Scheme By MATT STIEB The Trump Family crypto spree continues on the back end with a bitcoin mining plan. 3/31/2025 EARLY AND OFTEN If Trump Gets a 3rd Term, Democracy Will Have Already Ended By ED KILGORE Trump won’t stop talking about the possibility of a third term, despite very clear constitutional obstacles. 3/31/2025 POLITICS Trump Is Fantasizing About 3rd Term and War Over Greenland By CHAS DANNER He also “couldn’t care less” if his tariffs drive up car prices. 3/31/2025 MYSTERIES Where’s Forrest Fenn’s Treasure Now? By BENJAMIN WALLACE Justin Posey spent 780 days hunting for treasure in Yellowstone. In Netflix’s docuseries Gold & Greed, he reveals the launch of a new hunt. 3/31/2025 JUST ASKING QUESTIONS Tim Walz: Why We Lost By DANIEL STRAUSS The would-be Democratic vice-president on 2024’s mistakes and 2025’s opportunity. 3/31/2025 EARLY AND OFTEN The (Partial) Reinvention of Andrew Cuomo By DAVID FREEDLANDER He says he’s grown and learned. His brute-force takeover of the mayor’s race, at least, looks familiar 3/30/2025 SCREEN TIME Are Amazon’s New AI Chatbots Worth Using? By JOHN HERRMAN These new paths to the buy-now button also show how strange Amazon’s business has become. 3/29/2025 POLITICS Pete Hegseth Is Bringing His Wife and Brother to Work By CHAS DANNER Jennifer Hegseth has attended high-level meetings with foreign defense officials, and Phil Hegseth is now a top aide at the Pentagon. 3/29/2025 JUST ASKING QUESTIONS ‘Trump Knows a Good Grift When He Sees One’ By MATT STIEB A former SEC adviser and crypto skeptic explains Trump’s latest plans to make money — and conflicts of interest — in crypto. 3/28/2025 ROYALS How Are King Charles & Kate Middleton Doing? Latest Health Updates. By MARGARET HARTMANN Here’s the latest on Charles and Kate’s cancer battles, and how the royals are coping. 3/28/2025 WHO'S BUYING Trump’s Childhood Home Just Sold at a Huge Loss By ADRIANE QUINLAN AND MATTHEW SEDACCA The house in Jamaica Estates took a 61 percent price cut. Was it the feral cats? 3/28/2025 WHAT WE KNOW Why Are Visa and Green-Card Holders Being Detained and Deported? By CHAS DANNER, BENJAMIN HART, AND NIA PRATER There have been some harrowing reports about foreign nationals detained and deported amid Trump’s immigration crackdown. Here’s what we know. 3/28/2025 POLITICS The Pro-Israel Group That Led to Rumeysa Ozturk’s Arrest By NIA PRATER Canary Mission has a history of putting pro-Palestinian activists on the Trump administration’s radar. 3/28/2025 TREMENDOUS CONTENT Elise Stefanik Is ‘Proud’ to Have Dream Crushed by Trump By MARGARET HARTMANN A Fox News host gushed that Stefanik is a “selfless warrior” as the congresswoman claimed she’s okay with losing her U.N. ambassador gig. 3/28/2025 AUTO TARIFFS Who Is Going to Pay for Trump’s Auto Tariffs? By NIA PRATER AND CHAS DANNER The new 25 percent tariffs are supposed to start within days and could quickly drive up new car prices. Here’s what we know. 3/28/2025 THE SYSTEM Trump Is Redefining Terrorism By ZAK CHENEY-RICE Virtually anyone can be a terrorist now — except the people violently agitating on the president’s behalf. Like Us Follow Us Follow Us ABOUT INTELLIGENCER ABOUT NEW YORK MAGAZINE NEWSLETTERS HELP CONTACT PRESS MEDIA KIT WE’RE HIRING PRIVACY TERMS AD CHOICES ACCESSIBILITY MANAGE PRIVACY SETTINGS INTELLIGENCER IS A VOX MEDIA NETWORK. © 2025 VOX MEDIA, LLC. ALL RIGHTS RESERVED. This story is free for a limited time. Subscribe to enjoy uninterrupted access. Subscribe Now Privacy Notice We and our 880 partners store and access personal data, like browsing data or unique identifiers, on your device. Selecting Accept enables tracking technologies to support the purposes shown under we and our partners process data to provide. If trackers are disabled, some content and ads you see may not be as relevant to you. You can resurface this menu to change your choices or withdraw consent at any time by clicking the Manage Privacy Settings link on the bottom of the webpage . Your choices will have effect within our Website. For more details, refer to our Privacy Policy.Cookie Policy Ways we may use your data: Use precise geolocation data. Actively scan device characteristics for identification. Store and/or access information on a device. Personalised advertising and content, advertising and content measurement, audience research and services development. List of Partners (vendors) Accept Manage Settings",
        "headline": "The Guardian US Thrives Without a Paywall",
        "entry_sentence": "The Guardian US reports strong growth in reader donations, anticipating $44 million this year.",
        "detail": "With 60% of its revenue coming from voluntary contributions, the publication's reader-supported model is gaining traction amid rising interest in reliable news.",
        "icon": "💵"
    },
    {
        "title": "The <select> element can now be customized with CSS",
        "url": "https://developer.chrome.com/blog/a-customizable-select",
        "content": "Skip to main content developer.chrome.com uses cookies from Google to deliver and enhance the quality of its services and to analyze traffic. Learn more. Hide Get inspired Blog Docs New in Chrome / Sign in Blog On this page Meet appearance: base-select A <select> can now include rich HTML content Completely customizable Unchanged JavaScript interfaces Resources Chrome for Developers Blog Was this helpful? The <select> element can now be customized with CSS bookmark_border Adam Argyle Published: March 24, 2025 From Chrome 135, web developers and designers can finally unite on an accessible, standardized and CSS styleable <select> element on the web. This has been many years in the making, many hours of engineering and collaborative specification work, and the result is an incredibly rich and powerful component that won't break in older browsers. Here's a video of customized selects using these new features: Featuring demos by Una, Brecht, and Adam. If you've been following along closely, you'll notice a few spec names and features have changed since Una's request for community feedback. Luckily, if you worked from that post and are interested in what's changed, Una's also got you covered. There's also shiny new documentation on MDN for customizable select, packed with details. Meet appearance: base-select A new CSS property appearance: base-select that puts the <select> element into a new, configurable and styleable state to be commonly referred to as \"base\" styles: .custom-select { &, &::picker(select) { appearance: base-select; } } Using base-select unlocks a number of new features and behaviors: Changes the browsers HTML parser for the contents inside the <select>. Changes the rendered internals of the <select>. Exposes new internal parts and states for the <select>. A new minimal look, optimized for customization. Shown options are in the top-layer, like a popover. Shown options positioned with anchor(). Using base-select loses a number of features and behaviors: The <select> doesn't render outside the browser pane. It doesn't trigger built-in mobile operating system components. The <select> stops taking the width of the longest <option>. Expect more \"base\" appearances for other elements to develop over time! A <select> can now include rich HTML content Before you could customize a <select>, if you put things like an image or SVG into the <option> element, the browser would ignore them. Consider the following HTML, the browser would read it as you authored it: <select class=\"custom-select\"> <option> <svg aria-hidden>…</svg> <span>HTML</span> </option> <option> <svg aria-hidden>…</svg> <span>CSS</span> </option> <option> <svg aria-hidden>…</svg> <span>JavaScript</span> </option> <option> <svg aria-hidden>…</svg> <span>WASM</span> </option> </select> However the used DOM wouldn't include the <svg>: <select class=\"custom-select\"> <option> <span>HTML</span> </option> <option> <span>CSS</span> </option> <option> <span>JavaScript</span> </option> <option> <span>WASM</span> </option> </select> Here's (from left to right) Chrome, Safari, and Firefox rendering the preceding HTML. If the browser supports appearance: base-select then the SVG will appear in the option, otherwise it won't. Try it in this Codepen. There's risk in breaking existing websites with customizable select, due to the parser changes. Chrome has the features behind a Finch experiment in case there is an emergency need to turn it off. If things go well, the experiment will end and the code will be shipped permanently into the source. Completely customizable Every part of a base-select can be swapped out, customized and animated. Here's a demo that uses every new feature to create recognizable and meaningful select experiences. Try it in this Codepen. Find many more examples in the resources section at the end of this post. Unchanged JavaScript interfaces There's no risks to your existing JavaScript interactions with a <select> element. However, if you do begin adding rich HTML into your <option> elements, you should test the selected values, as the browser does still parse and ignore images and SVG. The logic has changed though, for determining the selected content string, and depending on what you have in your options, you may need to make adjustments. If you're using the value attribute on an <option> you have nothing to worry about. Resources Chrome is first to implement base-select, but every browser participated in the specifications, and there's more \"base\" elements yet to be completed. This is just a start. Stay tuned as we'll be continuing to add guidance, examples and resources on customizing select elements. Until then, checkout the following links for more information. Web Standards Open UI-Select HTML spec pull request Intent to Ship MDN Chrome Request for Comments and awesome Una explainer Request for Comments Results Use <hr> in a <select> Una explaining parts and pieces Una Codepen collection Community Brecht De Ruyte Codepen Collection CSS Tricks on native versus custom selects Open Props UI-<select> Custom select with transition animations example Special thanks to all those who were involved in making this happen! Was this helpful? Except as otherwise noted, the content of this page is licensed under the Creative Commons Attribution 4.0 License, and code samples are licensed under the Apache 2.0 License. For details, see the Google Developers Site Policies. Java is a registered trademark of Oracle and/or its affiliates. Last updated 2025-03-24 UTC. Contribute File a bug See open issues Related content Chromium updates Case studies Archive Podcasts & shows Follow @ChromiumDev on X YouTube Chrome for Developers on LinkedIn RSS Terms Privacy",
        "headline": "New customizable <select> element launched in Chrome",
        "entry_sentence": "Chrome has introduced a new, customizable <select> element that enhances web design.",
        "detail": "From Chrome version 135, developers can now include rich HTML content within <select> options, allowing for improved styling and customization.",
        "icon": "🎨"
    }
]