[
    {
        "title": "The demoscene as a UNESCO heritage in Sweden",
        "url": "https://www.goto80.com/the-demoscene-as-a-unesco-heritage-in-sweden",
        "content": "Music Performance Art Research Archive Random Contact The demoscene as a UNESCO heritage in Sweden Mar 31, 2025 | ramblings The demoscene has become a national UNESCO-heritage in Sweden, thanks to an application that Ziphoid and me did last year. This has already happened in several European countries, as part of the international Art of Coding initiative to make the demoscene a global UNESCO heritage. I think this makes plenty of sense, since the demoscene is arguably the oldest creative digital subculture around. It has largely stuck to its own values and traditions throughout the world’s technological and economical shifts, and that sort of consistency is quite unusual in the digital world. The main idea of the demoscene is to compete with productions that maximize a certain hardware, but that’s not what all demosceners like to do. My demogroup Hack n’ Trade for example, cares more about making weird stuff, and there are plenty of other groups like that. Some demosceners don’t release anything at all, but might do important work to keep the scene alive (BBS-trading, organizing parties, preserving software…). I’ve written plenty of papers and blog posts about the demoscene, and I’ve often felt a gap between the stuff I write as a researcher and my personal experience of the demoscene. There is certainly an international demoscene with big events and huge releases that can be described in general terms, but what has mattered more to me is the local scenes, the small parties and the people you hang out with. Meeting up with a bunch of friends and making weird computer stuff “for no reason, really” is a great setting. That’s what I enjoy the most, in the end. For other sceners, it’s different. There is a sort of diversity in the scene that is difficult to capture and generalize. The Swedish coder with a well-paid programming job and a busy family life might consider the demoscene as an escape to his teenage years, while the LSD-munching raver from France who trades illegal warez on BBSs and makes weird pixel art considers the scene as a free culture without corporate or art world bullshit. There’s room for both in the scene, because it is werdly conservative and open at the same time. And perhaps that is one of the reasons why it should be considered an intangible heritage.",
        "headline": "Demoscene recognized as UNESCO heritage in Sweden",
        "entry_sentence": "Sweden has officially designated the demoscene as national UNESCO heritage.",
        "detail": "This recognition follows an application submitted last year and is part of a broader initiative to globally acknowledge the demoscene as an important digital culture.",
        "icon": "🎨"
    },
    {
        "title": "Gemini 2.5 Pro vs. Claude 3.7 Sonnet: Coding Comparison",
        "url": "https://composio.dev/blog/gemini-2-5-pro-vs-claude-3-7-sonnet-coding-comparison/",
        "content": "Composio MCPNEW Tools Docs Pricing Explore TOOL KITS Composio MCP ➔ AgentAuth ➔ SWE-Kit ➔ SDR Kit ➔ AI Crypto Kit ➔ SOLUTIONS Enterprise ➔ Agency ➔ Startups Program ➔ Need Custom Solution? We also provide custom solutions for your business needs Talk to us Why Composio Integration for AI & LLMs Connect over 250 apps effortlessly 24/7 Support Blog Sign In Gemini 2.5 Pro vs. Claude 3.7 Sonnet: Coding Comparison SHRIJAL MARCH 30, 2025 CLAUDE, GEMINI, LLM 8 MIN READ Google just launched Gemini 2.5 Pro on March 26th, claiming to be the best in coding, reasoning and overall everything. But I mostly care about how the model compares against the best available coding model, Claude 3.7 Sonnet (thinking), released at the end of February, which I have been using, and it has been a great experience. Let’s compare these two coding models and see if I need to change my favourite coding model or if Claude 3.7 still holds. TL;DR If you want to jump straight to the conclusion, I’d say go for Gemini 2.5 Pro, it’s better at coding, has one million in context window as compared to Claude’s 200k, and you can get it for free (a big plus). However, Claude’s 3.7 Sonnet is not that far behind. Though at this point there’s no point using it over Gemini 2.5 Pro. Just an article ago, Claude 3.7 Sonnet was the default answer to every model comparison, and this remained the same for quite some time. But here you go, Gemini 2.5 Pro takes the lead. Brief on Gemini 2.5 Pro Gemini 2.5 Pro, an experimental thinking model, became the talk of the town within a week of its release. Everyone’s talking about this model on Twitter (X) and YouTube. It’s trending everywhere, like seriously. The first model from Google to receive such fanfare. And it is #1 in the LMArena just like that. But what does this mean? It means that this model is killing all the other models in coding, math, Science, Image understanding, and other areas. Gemini 2.5 pro comes with a 1 million token context window, with a 2 million context window coming soon. 🤯 You can check out other folks like Theo-t3 talking about this model to get a bit more insight into it: It is the best coding model to date, with an accuracy of about 63.8% on the SWE bench. This is definitely higher than our previous top coding model, Claude 3.7 Sonnet, which had an accuracy of about 62.3%. This is a quick demo Google shared on this model of building a dinosaur game. Here’s a quick benchmark of this model on Reasoning, Mathematics, and Science. This confirms that the model is not just suitable for coding but also for all your other needs. They claim it’s an all-rounder. 🤷‍♂️ This is all cool, and I’ll confirm the claim, but in this article, I will mainly be comparing the model on coding, and let’s see how well it performs compared to Claude 3.7 Sonnet. Coding Problems Let’s compare these two models in coding. We’ll do a total of 4 tests, mainly on WebDev, animation and a tricky LeetCode question. 1. Flight Simulator Prompt: Create a simple flight simulator using JavaScript. The simulator should feature a basic plane that can take off from a flat runway. The plane’s movement should be controlled with simple keyboard inputs (e.g., arrow keys or WASD). Additionally, it generates a basic cityscape using blocky structures, similar to Minecraft. Response from Gemini 2.5 Pro You can find the code it generated here: Link Here’s the output of the program: I definitely got exactly what I asked for, with everything functioning, from plane movements to the basic Minecraft-styled block buildings. I can’t really complain about anything here. 10/10 for this one. Response from Claude 3.7 Sonnet You can find the code it generated here: Link Here’s the output of the program: I can see some issues with this one. The plane clearly faces sideways, and I don’t know why. Again, it was out of control once it took off and went clearly outside the city. Basically, I’d say we didn’t really get a completely working flight simulator here. Summary: It’s fair to say that Gemini 2.5 really got this correct in one shot. But the issues with the Claude 3.7 Sonnet code aren’t really that big to resolve. Yeah, we didn’t really get the output as expected, and it’s definitely not close to what Gemini 2.5 Pro got us. 2. Rubik’s Cube Solver This is one of the toughest questions for LLMs. I’ve tried it with many other LLMs, but none could correct it. Let’s see how these two models do this one. Prompt: Build a simple 3D Rubik’s Cube visualizer and solver in JavaScript using Three.js. The cube should be a 3×3 Rubik’s Cube with standard colours. Have a scramble button that randomly scrambles the cube. Include a solve function that animates the solution step by step. Allow basic mouse controls to rotate the view. Response from Gemini 2.5 Pro You can find the code it generated here: Link Here’s the output of the program: It’s impressive that it could do something this hard in one shot. With the 1 million token context window, I can truly see how powerful this model seems to be. Response from Claude 3.7 Sonnet You can find the code it generated here: Link Here’s the output of the program: Again, I was kind of disappointed that it had the same issue as some other LLMs: failing with the colours and completely failing to solve the cube. I did try to help it come up with the answer, but it didn’t really help. Summary: Here again, Gemini 2.5 Pro takes the lead. And the best part is that all of it was done in one shot. Claude 3.7 was really disappointing, as it could not get this one correct, despite being one of the finest coding models out there. 3. Ball Bouncing Inside a Spinning 4D Tesseract Prompt: Create a simple JavaScript script that visualizes a ball bouncing inside a rotating 4D tesseract. When the ball collides with a side, highlight that side to indicate the impact. Response from Gemini 2.5 Pro You can find the code it generated here: Link Here’s the output of the program: I cannot notice a single issue in the output. The ball and the collision physics all work perfectly, even the part where I asked it to highlight the collision side works. This free model seems to be insane for coding. 🔥 Response from Claude 3.7 Sonnet You can find the code it generated here: Link Here’s the output of the program: Wow, finally, Claude 3.7 Sonnet got an answer correct. It also added colors to each side, but who asked for it? 🤷‍♂️ Nevertheless, I can’t really complain much here, as the main functionality seems to work just fine. Summary: The answer is evident this time. Both models got the answer correct, implementing everything I asked for. I won’t really say that I like the output of Claude 3.7 Sonnet more, but it definitely put in quite some work compared to Gemini 2.5 Pro. 4. LeetCode Problem For this one, let’s do a quick LeetCode check with to see how these models handle solving a tricky LeetCode question with an acceptance rate of just 14.9%: Maximum Value Sum by Placing 3 Rooks. Claude 3.7 Sonnet is known to be super good at solving LC questions. If you want to see how Claude 3.7 compares to some top models like Grok 3 and o3-mini-high, check out this blog post: Claude 3.7 Sonnet vs. Grok 3 vs. o3-mini-high: Coding comparison Prompt: You are given a m x n 2D array board representing a chessboard, where board[i][j] represents the value of the cell (i, j). Rooks in the same row or column attack each other. You need to place three rooks on the chessboard such that the rooks do not attack each other. Return the maximum sum of the cell values on which the rooks are placed. Example 1: Input: board = [[-3,1,1,1],[-3,1,-3,1],[-3,2,1,1]] Output: 4 Explanation: We can place the rooks in the cells (0, 2), (1, 3), and (2, 1) for a sum of 1 + 1 + 2 = 4. Example 2: Input: board = [[1,2,3],[4,5,6],[7,8,9]] Output: 15 Explanation: We can place the rooks in the cells (0, 0), (1, 1), and (2, 2) for a sum of 1 + 5 + 9 = 15. Example 3: Input: board = [[1,1,1],[1,1,1],[1,1,1]] Output: 3 Explanation: We can place the rooks in the cells (0, 2), (1, 1), and (2, 0) for a sum of 1 + 1 + 1 = 3. Constraints: 3 <= m == board.length <= 100 3 <= n == board[i].length <= 100 -109 <= board[i][j] <= 109 Response from Gemini 2.5 Pro Given how easily it answered all three of the coding questions we tested, I have quite high hopes for this model. You can find the code it generated here: Link It did take quite some time to answer this one, though, and the code it wrote is kind of super complex to make sense of. I think it answered it more complicated than required. But still, the main thing we’re looking for is to see if it can answer it correctly. As expected, it also answered this tough LeetCode question in one shot. This is one of the questions I got stuck on when learning DSA. I’m not sure if I’m happy it did. Response from Claude 3.7 Sonnet I hope this model will crush this one, as in all the other coding tests I’ve done, Claude 3.7 Sonnet has answered all of the LeetCode questions correctly. You can find the code it generated here: Link It did write correct code but got TLE, but if I have to compare the code’s simplicity, I’d say this model made the code simpler and easier to understand. Summary: Gemini 2.5 got the answer correct and also wrote the code in the expected time complexity, but Claude 3.7 Sonnet fell into TLE. If I have to compare the code simplicity, Claude 3.7’s generated code seems to be better. Conclusion For me, Gemini 2.5 Pro is the winner. We’ve compared two models that are said to be the best at coding. The big difference I see in the model stats is just that Gemini 2.5 Pro has a slightly higher context window, but let’s not forget that this is an experimental model, and improvements are still on the way. Imagine this model’s performance after a 2M token context window. Google’s been killing it recently with such solid models, previously with the Gemma 3 27B model, a super lightweight model with unbelievable results, and now with this beast of a model, Gemini 2.5 Pro. By the way, if you are here, Composio is building the skill repository for agents. You can connect LLMs to any application from Gmail to Asana and get things done quickly. You can use MCP servers, or directly add the tools to LLMs in the traditional agentic way. Leave a Reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Subscribe to newsletter Resources Tools Blog Docs Discord Case Studies Product Dashboard Pricing Startups Program Agency Enterprise Company Careers Security Contact © Composio 2024 Terms Privacy Policy",
        "headline": "Google's Gemini 2.5 Pro outshines Claude 3.7 Sonnet",
        "entry_sentence": "Google has launched its new AI model, Gemini 2.5 Pro, claiming it performs better in coding tasks than the existing model, Claude 3.7 Sonnet.",
        "detail": "In various coding tests, Gemini 2.5 Pro surpassed Claude 3.7 by delivering accurate results with a larger context window, making it the preferred choice for developers.",
        "icon": "🤖"
    },
    {
        "title": "Oracle attempt to hide cybersecurity incident from customers?",
        "url": "https://doublepulsar.com/oracle-attempt-to-hide-serious-cybersecurity-incident-from-customers-in-oracle-saas-service-9231c8daff4a",
        "content": "Write Sign up Sign in Home Following Library Stories Stats DoublePulsar Home Newsletter About Cybersecurity from the trenches, written by Kevin Beaumont. Opinions are of the author alone, not their employer. Follow publication 1 · Top highlight Oracle attempt to hide serious cybersecurity incident from customers in Oracle SaaS service Kevin Beaumont · Follow Published in DoublePulsar · 4 min read · 7 hours ago 37 2 Being a provider of cloud SaaS (Software-as-a-service) solutions requires certain cybersecurity responsibilities — including being transparent and open. The moment where this is tested at Oracle has arrived, as they have a serious cybersecurity incident playing out in a service they manage for customers. Back on March 21st, Bleeping Computer ran a story around a threat actor named rose87168 claiming to have breached some Oracle services inside *.oraclecloud.com Oracle told Bleeping Computer, and customers, “There has been no breach of Oracle Cloud. The published credentials are not for the Oracle Cloud. No Oracle Cloud customers experienced a breach or lost any data” The threat actor then posted an archive.org URL and provided it to Bleeping Computer, strongly suggesting they had write access to login.us2.oraclecloud.com, a service using Oracle Access Manager. This server is entirely managed by Oracle: https://cyberplace.social/@GossiTheDog/114202395143978043 Oracle have since requested Archive.org take down the proof: The threat actor then provided a several hour long recording of an internal Oracle meeting, complete with Oracle employees talking for two hours: The meeting is viewable here and the transcript is here: https://github.com/j-klawson/oracle_breach_2025/blob/main/youtube_video_transcript.txt The two hour video includes things like accessing internal Oracle password vaults, and customer facing systems: I’ve masked the root passwords of Oracle’s systems Both Hudson Rock and Bleeping Computer were then able to confirm with Oracle customers that their data — including staff email addresses — was in data released by the threat actor: Oracle customers confirm data stolen in alleged cloud breach is valid Despite Oracle denying a breach of its Oracle Cloud federated SSO login servers and the theft of account data for 6… www.bleepingcomputer.com The threat actor, rose87168, is still active online and releasing data — and threatening to release more: They have also released data to cybersecurity threat intelligence providers. In data released to a journalist for validation, it has now become 100% clear to me that there has been cybersecurity incident at Oracle, involving systems which processed customer data. For example, the threat actor has publicly provided complete Oracle configuration files — current, too. As one example, they have provided Oracle webserver configuration files: All the systems impacted are directly managed by Oracle. Some of the data provided to journalists is current, too. This is a serious cybersecurity incident which impacts customers, in a platform managed by Oracle. Oracle are attempting to wordsmith statements around Oracle Cloud and use very specific words to avoid responsibility. This is not okay. Oracle need to clearly, openly and publicly communicate what happened, how it impacts customers, and what they’re doing about it. This is a matter of trust and responsibility. Step up, Oracle — or customers should start stepping off. Update 1 — Oracle rebadged old Oracle Cloud services to be Oracle Classic. Oracle Classic has the security incident. Oracle are denying it on “Oracle Cloud” by using this scope — but it’s still Oracle cloud services that Oracle manage. That’s part of the wordplay. Update 2 — although Oracle used the archive.org exclusion process to remove evidence of writing to one of the Oraclecloud.com webservers, they forgot to remove the 2nd URL (click picture for hyperlink). The threat actor’s email address You can follow me on Mastodon for the latest updates, if you want: https://cyberplace.social/invite/hHiX8ntL or @gossithedog@cyberplace.social Sign up to discover human stories that deepen your understanding of the world. Free Distraction-free reading. No ads. Organize your knowledge with lists and highlights. Tell your story. Find your audience. Sign up for free Membership Read member-only stories Support writers you read most Earn money for your writing Listen to audio narrations Read offline with the Medium app Try for $5/month Cybersecurity News Oracle 37 2 Published in DoublePulsar 8.5K Followers · Last published 7 hours ago Cybersecurity from the trenches, written by Kevin Beaumont. Opinions are of the author alone, not their employer. Follow Written by Kevin Beaumont 17.5K Followers · 94 Following Everything here is my personal work and opinions. Follow Responses (2) Write a response What are your thoughts? Cancel Respond Also publish to my profile Shaant he/him 6 hours ago Oracle are attempting to wordsmith statements around Oracle Cloud and use very specific words to avoid responsibility. Dodging words won’t fix breaches. Clarity builds trust, not vague lines. Oracle knows this, but does it even care? 1 Reply Arik Nachmias 2 hours ago OOPS. Reply More from Kevin Beaumont and DoublePulsar In DoublePulsar by Kevin Beaumont Use one Virtual Machine to own them all — active exploitation of ESXicape A chain of three zero days allow threat actors to escape a Virtual Machine. Mar 5 194 2 In DoublePulsar by Kevin Beaumont No, there isn’t a world ending Apache Camel vulnerability Posts have been circulating publicly on the internet for several days about a “critical”, end of the world “zero day” in Apache Camel… Mar 9 132 2 In DoublePulsar by Kevin Beaumont RDP hijacking — how to hijack RDS and RemoteApp sessions transparently to move through an… How you can very easily use Remote Desktop Services to gain lateral movement through a network, using no external software — and how to… Mar 20, 2017 902 4 In DoublePulsar by Kevin Beaumont 2022 zero day was used to raid Fortigate firewall configs. Somebody just released them. Back in 2022, Fortinet warned that somebody had a zero day vulnerability and was using it to exploit Fortigate firewalls… Jan 16 53 3 See all from Kevin Beaumont See all from DoublePulsar Recommended from Medium Sebastian Carlos Fired From Meta After 1 Week: Here’s All The Dirt I Got This is not just another story of a disgruntled ex-employee. I’m not shying away from the serious corporate espionage or the ethical… Jan 8 18.2K 402 In System Weakness by Adarsh Pandey Top Cybersecurity Incident Investigation Examples Every SOC Analyst Should Know! Hey, cyber defenders! Welcome back. So, you’ve been grinding in the SOC (Security Operations Center) for a while, or you’re just starting… 6d ago 24 1 Harendra How I Am Using a Lifetime 100% Free Server Get a server with 24 GB RAM + 4 CPU + 200 GB Storage + Always Free Oct 26, 2024 9.6K 181 In AWS in Plain English by Taimur Ijlal Why Are Cybersecurity Professionals Losing Their Jobs In 2025 ? Layoffs Do Not Define You. How To Keep Moving Forward Feb 18 301 17 In The Mayor by Joe Helle Exam Review — SecOps Group Certified Active Directory Pentesting exPert (C-ADPenX) Introduction Mar 11 53 In Detect FYI by Sergio Albea Detecting attacks based on TCP Flags (DDOS, SYN Flood, and others) During 2024, I’ve been digging into TCP flags for a while because they can reveal a lot about malicious activity based on how they’re set… Mar 4 13 2 See more recommendations Help Status About Careers Press Blog Privacy Rules Terms Text to speech To make Medium work, we log user data. By using Medium, you agree to our Privacy Policy, including cookie policy.",
        "headline": "Oracle Faces Backlash Over Cybersecurity Incident",
        "entry_sentence": "Oracle is under scrutiny following claims of a serious cybersecurity incident affecting its services.",
        "detail": "A threat actor has allegedly breached Oracle's systems and posted sensitive customer data online, prompting demands for transparency from the company.",
        "icon": "🔒"
    }
]